/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const VM_EVENT_REASON_MOV_TO_MSR: u32 = 5;
pub const VM_EVENT_REASON_SOFTWARE_BREAKPOINT: u32 = 6;
pub const VM_EVENT_REASON_SINGLESTEP: u32 = 7;
pub const VM_EVENT_REASON_GUEST_REQUEST: u32 = 8;
pub const VM_EVENT_REASON_DEBUG_EXCEPTION: u32 = 9;
pub const VM_EVENT_REASON_CPUID: u32 = 10;
pub const VM_EVENT_REASON_PRIVILEGED_CALL: u32 = 11;
pub const VM_EVENT_REASON_INTERRUPT: u32 = 12;
pub const VM_EVENT_REASON_DESCRIPTOR_ACCESS: u32 = 13;
pub const VM_EVENT_REASON_EMUL_UNIMPLEMENTED: u32 = 14;
pub const VM_EVENT_REASON_VMEXIT: u32 = 15;
pub const VM_EVENT_REASON_IO_INSTRUCTION: u32 = 16;
pub const VM_EVENT_X86_CR0: u32 = 0;
pub const VM_EVENT_X86_CR3: u32 = 1;
pub const VM_EVENT_X86_CR4: u32 = 2;
pub const VM_EVENT_X86_XCR0: u32 = 3;
pub const MEM_ACCESS_R: u32 = 1;
pub const MEM_ACCESS_W: u32 = 2;
pub const MEM_ACCESS_X: u32 = 4;
pub const MEM_ACCESS_RWX: u32 = 7;
pub const MEM_ACCESS_RW: u32 = 3;
pub const MEM_ACCESS_RX: u32 = 5;
pub const MEM_ACCESS_WX: u32 = 6;
pub const MEM_ACCESS_GLA_VALID: u32 = 8;
pub const MEM_ACCESS_FAULT_WITH_GLA: u32 = 16;
pub const MEM_ACCESS_FAULT_IN_GPT: u32 = 32;
pub const VM_EVENT_DESC_IDTR: u32 = 1;
pub const VM_EVENT_DESC_GDTR: u32 = 2;
pub const VM_EVENT_DESC_LDTR: u32 = 3;
pub const VM_EVENT_DESC_TR: u32 = 4;
pub const MEM_PAGING_DROP_PAGE: u32 = 1;
pub const MEM_PAGING_EVICT_FAIL: u32 = 2;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type useconds_t = __useconds_t;
pub type pid_t = __pid_t;
pub type socklen_t = __socklen_t;
extern "C" {
    pub fn access(
        __name: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn faccessat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lseek(
        __fd: ::std::os::raw::c_int,
        __offset: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> __off_t;
}
extern "C" {
    pub fn close(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn closefrom(__lowfd: ::std::os::raw::c_int);
}
extern "C" {
    pub fn read(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
    ) -> isize;
}
extern "C" {
    pub fn write(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> isize;
}
extern "C" {
    pub fn pread(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pwrite(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pipe(__pipedes: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alarm(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn sleep(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn ualarm(__value: __useconds_t, __interval: __useconds_t) -> __useconds_t;
}
extern "C" {
    pub fn usleep(__useconds: __useconds_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pause() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchown(
        __fd: ::std::os::raw::c_int,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lchown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchownat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchdir(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getcwd(__buf: *mut ::std::os::raw::c_char, __size: usize)
        -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getwd(__buf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn dup(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dup2(__fd: ::std::os::raw::c_int, __fd2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __environ: *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn execve(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fexecve(
        __fd: ::std::os::raw::c_int,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execv(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execle(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execl(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execvp(
        __file: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execlp(
        __file: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nice(__inc: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _exit(__status: ::std::os::raw::c_int) -> !;
}
pub const _PC_LINK_MAX: _bindgen_ty_1 = 0;
pub const _PC_MAX_CANON: _bindgen_ty_1 = 1;
pub const _PC_MAX_INPUT: _bindgen_ty_1 = 2;
pub const _PC_NAME_MAX: _bindgen_ty_1 = 3;
pub const _PC_PATH_MAX: _bindgen_ty_1 = 4;
pub const _PC_PIPE_BUF: _bindgen_ty_1 = 5;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_1 = 6;
pub const _PC_NO_TRUNC: _bindgen_ty_1 = 7;
pub const _PC_VDISABLE: _bindgen_ty_1 = 8;
pub const _PC_SYNC_IO: _bindgen_ty_1 = 9;
pub const _PC_ASYNC_IO: _bindgen_ty_1 = 10;
pub const _PC_PRIO_IO: _bindgen_ty_1 = 11;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_1 = 12;
pub const _PC_FILESIZEBITS: _bindgen_ty_1 = 13;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_1 = 14;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_1 = 15;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_1 = 16;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_1 = 17;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_1 = 18;
pub const _PC_SYMLINK_MAX: _bindgen_ty_1 = 19;
pub const _PC_2_SYMLINKS: _bindgen_ty_1 = 20;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const _SC_ARG_MAX: _bindgen_ty_2 = 0;
pub const _SC_CHILD_MAX: _bindgen_ty_2 = 1;
pub const _SC_CLK_TCK: _bindgen_ty_2 = 2;
pub const _SC_NGROUPS_MAX: _bindgen_ty_2 = 3;
pub const _SC_OPEN_MAX: _bindgen_ty_2 = 4;
pub const _SC_STREAM_MAX: _bindgen_ty_2 = 5;
pub const _SC_TZNAME_MAX: _bindgen_ty_2 = 6;
pub const _SC_JOB_CONTROL: _bindgen_ty_2 = 7;
pub const _SC_SAVED_IDS: _bindgen_ty_2 = 8;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_2 = 9;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_2 = 10;
pub const _SC_TIMERS: _bindgen_ty_2 = 11;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_2 = 12;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_2 = 13;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_2 = 14;
pub const _SC_FSYNC: _bindgen_ty_2 = 15;
pub const _SC_MAPPED_FILES: _bindgen_ty_2 = 16;
pub const _SC_MEMLOCK: _bindgen_ty_2 = 17;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_2 = 18;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_2 = 19;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_2 = 20;
pub const _SC_SEMAPHORES: _bindgen_ty_2 = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_2 = 22;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_2 = 23;
pub const _SC_AIO_MAX: _bindgen_ty_2 = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_2 = 25;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_2 = 26;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_2 = 27;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_2 = 28;
pub const _SC_VERSION: _bindgen_ty_2 = 29;
pub const _SC_PAGESIZE: _bindgen_ty_2 = 30;
pub const _SC_RTSIG_MAX: _bindgen_ty_2 = 31;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_2 = 32;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_2 = 33;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_2 = 34;
pub const _SC_TIMER_MAX: _bindgen_ty_2 = 35;
pub const _SC_BC_BASE_MAX: _bindgen_ty_2 = 36;
pub const _SC_BC_DIM_MAX: _bindgen_ty_2 = 37;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_2 = 38;
pub const _SC_BC_STRING_MAX: _bindgen_ty_2 = 39;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_2 = 40;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_2 = 41;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_2 = 42;
pub const _SC_LINE_MAX: _bindgen_ty_2 = 43;
pub const _SC_RE_DUP_MAX: _bindgen_ty_2 = 44;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_2 = 45;
pub const _SC_2_VERSION: _bindgen_ty_2 = 46;
pub const _SC_2_C_BIND: _bindgen_ty_2 = 47;
pub const _SC_2_C_DEV: _bindgen_ty_2 = 48;
pub const _SC_2_FORT_DEV: _bindgen_ty_2 = 49;
pub const _SC_2_FORT_RUN: _bindgen_ty_2 = 50;
pub const _SC_2_SW_DEV: _bindgen_ty_2 = 51;
pub const _SC_2_LOCALEDEF: _bindgen_ty_2 = 52;
pub const _SC_PII: _bindgen_ty_2 = 53;
pub const _SC_PII_XTI: _bindgen_ty_2 = 54;
pub const _SC_PII_SOCKET: _bindgen_ty_2 = 55;
pub const _SC_PII_INTERNET: _bindgen_ty_2 = 56;
pub const _SC_PII_OSI: _bindgen_ty_2 = 57;
pub const _SC_POLL: _bindgen_ty_2 = 58;
pub const _SC_SELECT: _bindgen_ty_2 = 59;
pub const _SC_UIO_MAXIOV: _bindgen_ty_2 = 60;
pub const _SC_IOV_MAX: _bindgen_ty_2 = 60;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_2 = 61;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_2 = 62;
pub const _SC_PII_OSI_COTS: _bindgen_ty_2 = 63;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_2 = 64;
pub const _SC_PII_OSI_M: _bindgen_ty_2 = 65;
pub const _SC_T_IOV_MAX: _bindgen_ty_2 = 66;
pub const _SC_THREADS: _bindgen_ty_2 = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_2 = 68;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_2 = 69;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_2 = 70;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_2 = 71;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_2 = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_2 = 73;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_2 = 74;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_2 = 75;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_2 = 76;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_2 = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_2 = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_2 = 79;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_2 = 80;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_2 = 81;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_2 = 82;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_2 = 83;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_2 = 84;
pub const _SC_PHYS_PAGES: _bindgen_ty_2 = 85;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_2 = 86;
pub const _SC_ATEXIT_MAX: _bindgen_ty_2 = 87;
pub const _SC_PASS_MAX: _bindgen_ty_2 = 88;
pub const _SC_XOPEN_VERSION: _bindgen_ty_2 = 89;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_2 = 90;
pub const _SC_XOPEN_UNIX: _bindgen_ty_2 = 91;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_2 = 92;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_2 = 93;
pub const _SC_XOPEN_SHM: _bindgen_ty_2 = 94;
pub const _SC_2_CHAR_TERM: _bindgen_ty_2 = 95;
pub const _SC_2_C_VERSION: _bindgen_ty_2 = 96;
pub const _SC_2_UPE: _bindgen_ty_2 = 97;
pub const _SC_XOPEN_XPG2: _bindgen_ty_2 = 98;
pub const _SC_XOPEN_XPG3: _bindgen_ty_2 = 99;
pub const _SC_XOPEN_XPG4: _bindgen_ty_2 = 100;
pub const _SC_CHAR_BIT: _bindgen_ty_2 = 101;
pub const _SC_CHAR_MAX: _bindgen_ty_2 = 102;
pub const _SC_CHAR_MIN: _bindgen_ty_2 = 103;
pub const _SC_INT_MAX: _bindgen_ty_2 = 104;
pub const _SC_INT_MIN: _bindgen_ty_2 = 105;
pub const _SC_LONG_BIT: _bindgen_ty_2 = 106;
pub const _SC_WORD_BIT: _bindgen_ty_2 = 107;
pub const _SC_MB_LEN_MAX: _bindgen_ty_2 = 108;
pub const _SC_NZERO: _bindgen_ty_2 = 109;
pub const _SC_SSIZE_MAX: _bindgen_ty_2 = 110;
pub const _SC_SCHAR_MAX: _bindgen_ty_2 = 111;
pub const _SC_SCHAR_MIN: _bindgen_ty_2 = 112;
pub const _SC_SHRT_MAX: _bindgen_ty_2 = 113;
pub const _SC_SHRT_MIN: _bindgen_ty_2 = 114;
pub const _SC_UCHAR_MAX: _bindgen_ty_2 = 115;
pub const _SC_UINT_MAX: _bindgen_ty_2 = 116;
pub const _SC_ULONG_MAX: _bindgen_ty_2 = 117;
pub const _SC_USHRT_MAX: _bindgen_ty_2 = 118;
pub const _SC_NL_ARGMAX: _bindgen_ty_2 = 119;
pub const _SC_NL_LANGMAX: _bindgen_ty_2 = 120;
pub const _SC_NL_MSGMAX: _bindgen_ty_2 = 121;
pub const _SC_NL_NMAX: _bindgen_ty_2 = 122;
pub const _SC_NL_SETMAX: _bindgen_ty_2 = 123;
pub const _SC_NL_TEXTMAX: _bindgen_ty_2 = 124;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_2 = 125;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_2 = 126;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_2 = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_2 = 128;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_2 = 129;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_2 = 130;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_2 = 131;
pub const _SC_ADVISORY_INFO: _bindgen_ty_2 = 132;
pub const _SC_BARRIERS: _bindgen_ty_2 = 133;
pub const _SC_BASE: _bindgen_ty_2 = 134;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_2 = 135;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_2 = 136;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_2 = 137;
pub const _SC_CPUTIME: _bindgen_ty_2 = 138;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_2 = 139;
pub const _SC_DEVICE_IO: _bindgen_ty_2 = 140;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_2 = 141;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_2 = 142;
pub const _SC_FD_MGMT: _bindgen_ty_2 = 143;
pub const _SC_FIFO: _bindgen_ty_2 = 144;
pub const _SC_PIPE: _bindgen_ty_2 = 145;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_2 = 146;
pub const _SC_FILE_LOCKING: _bindgen_ty_2 = 147;
pub const _SC_FILE_SYSTEM: _bindgen_ty_2 = 148;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_2 = 149;
pub const _SC_MULTI_PROCESS: _bindgen_ty_2 = 150;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_2 = 151;
pub const _SC_NETWORKING: _bindgen_ty_2 = 152;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_2 = 153;
pub const _SC_SPIN_LOCKS: _bindgen_ty_2 = 154;
pub const _SC_REGEXP: _bindgen_ty_2 = 155;
pub const _SC_REGEX_VERSION: _bindgen_ty_2 = 156;
pub const _SC_SHELL: _bindgen_ty_2 = 157;
pub const _SC_SIGNALS: _bindgen_ty_2 = 158;
pub const _SC_SPAWN: _bindgen_ty_2 = 159;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_2 = 160;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_2 = 161;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_2 = 162;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_2 = 163;
pub const _SC_TIMEOUTS: _bindgen_ty_2 = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_2 = 165;
pub const _SC_USER_GROUPS: _bindgen_ty_2 = 166;
pub const _SC_USER_GROUPS_R: _bindgen_ty_2 = 167;
pub const _SC_2_PBS: _bindgen_ty_2 = 168;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_2 = 169;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_2 = 170;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_2 = 171;
pub const _SC_2_PBS_TRACK: _bindgen_ty_2 = 172;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_2 = 173;
pub const _SC_STREAMS: _bindgen_ty_2 = 174;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_2 = 175;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_2 = 176;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_2 = 177;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_2 = 178;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_2 = 179;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_2 = 180;
pub const _SC_TRACE: _bindgen_ty_2 = 181;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_2 = 182;
pub const _SC_TRACE_INHERIT: _bindgen_ty_2 = 183;
pub const _SC_TRACE_LOG: _bindgen_ty_2 = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_2 = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_2 = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_2 = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_2 = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_2 = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_2 = 190;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_2 = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_2 = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_2 = 193;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_2 = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_2 = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_2 = 196;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_2 = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_2 = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_2 = 199;
pub const _SC_IPV6: _bindgen_ty_2 = 235;
pub const _SC_RAW_SOCKETS: _bindgen_ty_2 = 236;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_2 = 237;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_2 = 238;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_2 = 239;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_2 = 240;
pub const _SC_SS_REPL_MAX: _bindgen_ty_2 = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_2 = 242;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_2 = 243;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_2 = 244;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_2 = 245;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_2 = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_2 = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_2 = 248;
pub const _SC_MINSIGSTKSZ: _bindgen_ty_2 = 249;
pub const _SC_SIGSTKSZ: _bindgen_ty_2 = 250;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const _CS_PATH: _bindgen_ty_3 = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 1;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_3 = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_3 = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_3 = 5;
pub const _CS_LFS_CFLAGS: _bindgen_ty_3 = 1000;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_3 = 1001;
pub const _CS_LFS_LIBS: _bindgen_ty_3 = 1002;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_3 = 1003;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_3 = 1004;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_3 = 1005;
pub const _CS_LFS64_LIBS: _bindgen_ty_3 = 1006;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_3 = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_3 = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_3 = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_3 = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_3 = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_3 = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_3 = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_3 = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_3 = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_3 = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_3 = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_3 = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_3 = 1143;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_3 = 1144;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_3 = 1145;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_3 = 1146;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_3 = 1147;
pub const _CS_V6_ENV: _bindgen_ty_3 = 1148;
pub const _CS_V7_ENV: _bindgen_ty_3 = 1149;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub fn pathconf(
        __path: *const ::std::os::raw::c_char,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fpathconf(
        __fd: ::std::os::raw::c_int,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn sysconf(__name: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn confstr(
        __name: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> usize;
}
extern "C" {
    pub fn getpid() -> __pid_t;
}
extern "C" {
    pub fn getppid() -> __pid_t;
}
extern "C" {
    pub fn getpgrp() -> __pid_t;
}
extern "C" {
    pub fn __getpgid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn getpgid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn setpgid(__pid: __pid_t, __pgid: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setpgrp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsid() -> __pid_t;
}
extern "C" {
    pub fn getsid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn getuid() -> __uid_t;
}
extern "C" {
    pub fn geteuid() -> __uid_t;
}
extern "C" {
    pub fn getgid() -> __gid_t;
}
extern "C" {
    pub fn getegid() -> __gid_t;
}
extern "C" {
    pub fn getgroups(__size: ::std::os::raw::c_int, __list: *mut __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setreuid(__ruid: __uid_t, __euid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seteuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setgid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setregid(__rgid: __gid_t, __egid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setegid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fork() -> __pid_t;
}
extern "C" {
    pub fn vfork() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ttyname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isatty(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyslot() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn link(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn linkat(
        __fromfd: ::std::os::raw::c_int,
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn symlink(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlink(
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
extern "C" {
    pub fn symlinkat(
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlinkat(
        __fd: ::std::os::raw::c_int,
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
extern "C" {
    pub fn unlink(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlinkat(
        __fd: ::std::os::raw::c_int,
        __name: *const ::std::os::raw::c_char,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rmdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcgetpgrp(__fd: ::std::os::raw::c_int) -> __pid_t;
}
extern "C" {
    pub fn tcsetpgrp(__fd: ::std::os::raw::c_int, __pgrp_id: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getlogin_r(
        __name: *mut ::std::os::raw::c_char,
        __name_len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setlogin(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
extern "C" {
    pub fn getopt(
        ___argc: ::std::os::raw::c_int,
        ___argv: *const *mut ::std::os::raw::c_char,
        __shortopts: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostname(__name: *mut ::std::os::raw::c_char, __len: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sethostname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sethostid(__id: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdomainname(
        __name: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setdomainname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vhangup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn revoke(__file: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn profil(
        __sample_buffer: *mut ::std::os::raw::c_ushort,
        __size: usize,
        __offset: usize,
        __scale: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acct(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getusershell() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn endusershell();
}
extern "C" {
    pub fn setusershell();
}
extern "C" {
    pub fn daemon(
        __nochdir: ::std::os::raw::c_int,
        __noclose: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chroot(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpass(__prompt: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fsync(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostid() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn sync();
}
extern "C" {
    pub fn getpagesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdtablesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn truncate(
        __file: *const ::std::os::raw::c_char,
        __length: __off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftruncate(__fd: ::std::os::raw::c_int, __length: __off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn brk(__addr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sbrk(__delta: isize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn syscall(__sysno: ::std::os::raw::c_long, ...) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lockf(
        __fd: ::std::os::raw::c_int,
        __cmd: ::std::os::raw::c_int,
        __len: __off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdatasync(__fildes: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn crypt(
        __key: *const ::std::os::raw::c_char,
        __salt: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getentropy(
        __buffer: *mut ::std::os::raw::c_void,
        __length: usize,
    ) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
impl Default for __mbstate_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
impl Default for __mbstate_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
impl Default for _G_fpos_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
impl Default for _G_fpos64_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
impl Default for _IO_FILE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct iret_context {
    pub rax: u64,
    pub r11: u64,
    pub rcx: u64,
    pub flags: u64,
    pub rip: u64,
    pub cs: u64,
    pub rflags: u64,
    pub rsp: u64,
    pub ss: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iret_context"][::std::mem::size_of::<iret_context>() - 72usize];
    ["Alignment of iret_context"][::std::mem::align_of::<iret_context>() - 8usize];
    ["Offset of field: iret_context::rax"][::std::mem::offset_of!(iret_context, rax) - 0usize];
    ["Offset of field: iret_context::r11"][::std::mem::offset_of!(iret_context, r11) - 8usize];
    ["Offset of field: iret_context::rcx"][::std::mem::offset_of!(iret_context, rcx) - 16usize];
    ["Offset of field: iret_context::flags"][::std::mem::offset_of!(iret_context, flags) - 24usize];
    ["Offset of field: iret_context::rip"][::std::mem::offset_of!(iret_context, rip) - 32usize];
    ["Offset of field: iret_context::cs"][::std::mem::offset_of!(iret_context, cs) - 40usize];
    ["Offset of field: iret_context::rflags"]
        [::std::mem::offset_of!(iret_context, rflags) - 48usize];
    ["Offset of field: iret_context::rsp"][::std::mem::offset_of!(iret_context, rsp) - 56usize];
    ["Offset of field: iret_context::ss"][::std::mem::offset_of!(iret_context, ss) - 64usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cpu_user_regs {
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_1,
    pub __bindgen_anon_2: cpu_user_regs__bindgen_ty_2,
    pub __bindgen_anon_3: cpu_user_regs__bindgen_ty_3,
    pub __bindgen_anon_4: cpu_user_regs__bindgen_ty_4,
    pub __bindgen_anon_5: cpu_user_regs__bindgen_ty_5,
    pub __bindgen_anon_6: cpu_user_regs__bindgen_ty_6,
    pub __bindgen_anon_7: cpu_user_regs__bindgen_ty_7,
    pub __bindgen_anon_8: cpu_user_regs__bindgen_ty_8,
    pub __bindgen_anon_9: cpu_user_regs__bindgen_ty_9,
    pub __bindgen_anon_10: cpu_user_regs__bindgen_ty_10,
    pub __bindgen_anon_11: cpu_user_regs__bindgen_ty_11,
    pub __bindgen_anon_12: cpu_user_regs__bindgen_ty_12,
    pub __bindgen_anon_13: cpu_user_regs__bindgen_ty_13,
    pub __bindgen_anon_14: cpu_user_regs__bindgen_ty_14,
    pub __bindgen_anon_15: cpu_user_regs__bindgen_ty_15,
    pub error_code: u32,
    pub entry_vector: u32,
    pub __bindgen_anon_16: cpu_user_regs__bindgen_ty_16,
    pub cs: u16,
    pub _pad0: [u16; 1usize],
    pub saved_upcall_mask: u8,
    pub _pad1: [u8; 3usize],
    pub __bindgen_anon_17: cpu_user_regs__bindgen_ty_17,
    pub __bindgen_anon_18: cpu_user_regs__bindgen_ty_18,
    pub ss: u16,
    pub _pad2: [u16; 3usize],
    pub es: u16,
    pub _pad3: [u16; 3usize],
    pub ds: u16,
    pub _pad4: [u16; 3usize],
    pub fs: u16,
    pub _pad5: [u16; 3usize],
    pub gs: u16,
    pub _pad6: [u16; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_1 {
    pub r15: u64,
    pub r15d: u32,
    pub r15w: u16,
    pub r15b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_1"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_1>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_1"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_1>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_1::r15"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_1, r15) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_1::r15d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_1, r15d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_1::r15w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_1, r15w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_1::r15b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_1, r15b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_2 {
    pub r14: u64,
    pub r14d: u32,
    pub r14w: u16,
    pub r14b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_2"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_2>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_2"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_2>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_2::r14"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_2, r14) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_2::r14d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_2, r14d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_2::r14w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_2, r14w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_2::r14b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_2, r14b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_3 {
    pub r13: u64,
    pub r13d: u32,
    pub r13w: u16,
    pub r13b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_3"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_3>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_3"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_3>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_3::r13"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_3, r13) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_3::r13d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_3, r13d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_3::r13w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_3, r13w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_3::r13b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_3, r13b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_4 {
    pub r12: u64,
    pub r12d: u32,
    pub r12w: u16,
    pub r12b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_4"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_4>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_4"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_4>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_4::r12"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_4, r12) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_4::r12d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_4, r12d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_4::r12w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_4, r12w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_4::r12b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_4, r12b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_5 {
    pub rbp: u64,
    pub ebp: u32,
    pub bp: u16,
    pub bpl: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_5"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_5>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_5"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_5>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_5::rbp"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_5, rbp) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_5::ebp"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_5, ebp) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_5::bp"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_5, bp) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_5::bpl"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_5, bpl) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_5 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_6 {
    pub rbx: u64,
    pub ebx: u32,
    pub bx: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_6__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_6__bindgen_ty_1 {
    pub bl: u8,
    pub bh: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_6__bindgen_ty_1"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_6__bindgen_ty_1>() - 2usize];
    ["Alignment of cpu_user_regs__bindgen_ty_6__bindgen_ty_1"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_6__bindgen_ty_1>() - 1usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_6__bindgen_ty_1::bl"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_6__bindgen_ty_1, bl) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_6__bindgen_ty_1::bh"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_6__bindgen_ty_1, bh) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_6"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_6>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_6"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_6>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_6::rbx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_6, rbx) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_6::ebx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_6, ebx) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_6::bx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_6, bx) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_6 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_7 {
    pub r11: u64,
    pub r11d: u32,
    pub r11w: u16,
    pub r11b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_7"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_7>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_7"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_7>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_7::r11"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_7, r11) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_7::r11d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_7, r11d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_7::r11w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_7, r11w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_7::r11b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_7, r11b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_7 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_8 {
    pub r10: u64,
    pub r10d: u32,
    pub r10w: u16,
    pub r10b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_8"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_8>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_8"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_8>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_8::r10"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_8, r10) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_8::r10d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_8, r10d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_8::r10w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_8, r10w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_8::r10b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_8, r10b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_8 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_9 {
    pub r9: u64,
    pub r9d: u32,
    pub r9w: u16,
    pub r9b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_9"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_9>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_9"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_9>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_9::r9"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_9, r9) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_9::r9d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_9, r9d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_9::r9w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_9, r9w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_9::r9b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_9, r9b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_9 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_10 {
    pub r8: u64,
    pub r8d: u32,
    pub r8w: u16,
    pub r8b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_10"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_10>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_10"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_10>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_10::r8"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_10, r8) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_10::r8d"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_10, r8d) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_10::r8w"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_10, r8w) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_10::r8b"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_10, r8b) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_10 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_11 {
    pub rax: u64,
    pub eax: u32,
    pub ax: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_11__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_11__bindgen_ty_1 {
    pub al: u8,
    pub ah: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_11__bindgen_ty_1"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_11__bindgen_ty_1>() - 2usize];
    ["Alignment of cpu_user_regs__bindgen_ty_11__bindgen_ty_1"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_11__bindgen_ty_1>() - 1usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_11__bindgen_ty_1::al"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_11__bindgen_ty_1, al) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_11__bindgen_ty_1::ah"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_11__bindgen_ty_1, ah) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_11"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_11>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_11"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_11>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_11::rax"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_11, rax) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_11::eax"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_11, eax) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_11::ax"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_11, ax) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_11 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_12 {
    pub rcx: u64,
    pub ecx: u32,
    pub cx: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_12__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_12__bindgen_ty_1 {
    pub cl: u8,
    pub ch: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_12__bindgen_ty_1"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_12__bindgen_ty_1>() - 2usize];
    ["Alignment of cpu_user_regs__bindgen_ty_12__bindgen_ty_1"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_12__bindgen_ty_1>() - 1usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_12__bindgen_ty_1::cl"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_12__bindgen_ty_1, cl) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_12__bindgen_ty_1::ch"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_12__bindgen_ty_1, ch) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_12"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_12>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_12"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_12>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_12::rcx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_12, rcx) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_12::ecx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_12, ecx) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_12::cx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_12, cx) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_12 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_13 {
    pub rdx: u64,
    pub edx: u32,
    pub dx: u16,
    pub __bindgen_anon_1: cpu_user_regs__bindgen_ty_13__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_user_regs__bindgen_ty_13__bindgen_ty_1 {
    pub dl: u8,
    pub dh: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_13__bindgen_ty_1"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_13__bindgen_ty_1>() - 2usize];
    ["Alignment of cpu_user_regs__bindgen_ty_13__bindgen_ty_1"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_13__bindgen_ty_1>() - 1usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_13__bindgen_ty_1::dl"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_13__bindgen_ty_1, dl) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_13__bindgen_ty_1::dh"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_13__bindgen_ty_1, dh) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_13"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_13>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_13"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_13>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_13::rdx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_13, rdx) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_13::edx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_13, edx) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_13::dx"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_13, dx) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_13 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_14 {
    pub rsi: u64,
    pub esi: u32,
    pub si: u16,
    pub sil: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_14"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_14>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_14"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_14>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_14::rsi"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_14, rsi) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_14::esi"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_14, esi) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_14::si"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_14, si) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_14::sil"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_14, sil) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_14 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_15 {
    pub rdi: u64,
    pub edi: u32,
    pub di: u16,
    pub dil: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_15"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_15>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_15"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_15>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_15::rdi"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_15, rdi) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_15::edi"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_15, edi) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_15::di"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_15, di) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_15::dil"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_15, dil) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_15 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_16 {
    pub rip: u64,
    pub eip: u32,
    pub ip: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_16"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_16>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_16"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_16>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_16::rip"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_16, rip) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_16::eip"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_16, eip) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_16::ip"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_16, ip) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_16 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_17 {
    pub rflags: u64,
    pub eflags: u32,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_17"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_17>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_17"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_17>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_17::rflags"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_17, rflags) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_17::eflags"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_17, eflags) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_17::flags"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_17, flags) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_17 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cpu_user_regs__bindgen_ty_18 {
    pub rsp: u64,
    pub esp: u32,
    pub sp: u16,
    pub spl: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs__bindgen_ty_18"]
        [::std::mem::size_of::<cpu_user_regs__bindgen_ty_18>() - 8usize];
    ["Alignment of cpu_user_regs__bindgen_ty_18"]
        [::std::mem::align_of::<cpu_user_regs__bindgen_ty_18>() - 8usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_18::rsp"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_18, rsp) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_18::esp"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_18, esp) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_18::sp"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_18, sp) - 0usize];
    ["Offset of field: cpu_user_regs__bindgen_ty_18::spl"]
        [::std::mem::offset_of!(cpu_user_regs__bindgen_ty_18, spl) - 0usize];
};
impl Default for cpu_user_regs__bindgen_ty_18 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_user_regs"][::std::mem::size_of::<cpu_user_regs>() - 200usize];
    ["Alignment of cpu_user_regs"][::std::mem::align_of::<cpu_user_regs>() - 8usize];
    ["Offset of field: cpu_user_regs::error_code"]
        [::std::mem::offset_of!(cpu_user_regs, error_code) - 120usize];
    ["Offset of field: cpu_user_regs::entry_vector"]
        [::std::mem::offset_of!(cpu_user_regs, entry_vector) - 124usize];
    ["Offset of field: cpu_user_regs::cs"][::std::mem::offset_of!(cpu_user_regs, cs) - 136usize];
    ["Offset of field: cpu_user_regs::_pad0"]
        [::std::mem::offset_of!(cpu_user_regs, _pad0) - 138usize];
    ["Offset of field: cpu_user_regs::saved_upcall_mask"]
        [::std::mem::offset_of!(cpu_user_regs, saved_upcall_mask) - 140usize];
    ["Offset of field: cpu_user_regs::_pad1"]
        [::std::mem::offset_of!(cpu_user_regs, _pad1) - 141usize];
    ["Offset of field: cpu_user_regs::ss"][::std::mem::offset_of!(cpu_user_regs, ss) - 160usize];
    ["Offset of field: cpu_user_regs::_pad2"]
        [::std::mem::offset_of!(cpu_user_regs, _pad2) - 162usize];
    ["Offset of field: cpu_user_regs::es"][::std::mem::offset_of!(cpu_user_regs, es) - 168usize];
    ["Offset of field: cpu_user_regs::_pad3"]
        [::std::mem::offset_of!(cpu_user_regs, _pad3) - 170usize];
    ["Offset of field: cpu_user_regs::ds"][::std::mem::offset_of!(cpu_user_regs, ds) - 176usize];
    ["Offset of field: cpu_user_regs::_pad4"]
        [::std::mem::offset_of!(cpu_user_regs, _pad4) - 178usize];
    ["Offset of field: cpu_user_regs::fs"][::std::mem::offset_of!(cpu_user_regs, fs) - 184usize];
    ["Offset of field: cpu_user_regs::_pad5"]
        [::std::mem::offset_of!(cpu_user_regs, _pad5) - 186usize];
    ["Offset of field: cpu_user_regs::gs"][::std::mem::offset_of!(cpu_user_regs, gs) - 192usize];
    ["Offset of field: cpu_user_regs::_pad6"]
        [::std::mem::offset_of!(cpu_user_regs, _pad6) - 194usize];
};
impl Default for cpu_user_regs {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type cpu_user_regs_t = cpu_user_regs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_cpu_user_regs_t {
    pub p: *mut cpu_user_regs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_cpu_user_regs_t"]
        [::std::mem::size_of::<__guest_handle_cpu_user_regs_t>() - 8usize];
    ["Alignment of __guest_handle_cpu_user_regs_t"]
        [::std::mem::align_of::<__guest_handle_cpu_user_regs_t>() - 8usize];
    ["Offset of field: __guest_handle_cpu_user_regs_t::p"]
        [::std::mem::offset_of!(__guest_handle_cpu_user_regs_t, p) - 0usize];
};
impl Default for __guest_handle_cpu_user_regs_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_cpu_user_regs_t {
    pub p: *const cpu_user_regs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_cpu_user_regs_t"]
        [::std::mem::size_of::<__guest_handle_const_cpu_user_regs_t>() - 8usize];
    ["Alignment of __guest_handle_const_cpu_user_regs_t"]
        [::std::mem::align_of::<__guest_handle_const_cpu_user_regs_t>() - 8usize];
    ["Offset of field: __guest_handle_const_cpu_user_regs_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_cpu_user_regs_t, p) - 0usize];
};
impl Default for __guest_handle_const_cpu_user_regs_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct arch_vcpu_info {
    pub cr2: ::std::os::raw::c_ulong,
    pub pad: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arch_vcpu_info"][::std::mem::size_of::<arch_vcpu_info>() - 16usize];
    ["Alignment of arch_vcpu_info"][::std::mem::align_of::<arch_vcpu_info>() - 8usize];
    ["Offset of field: arch_vcpu_info::cr2"][::std::mem::offset_of!(arch_vcpu_info, cr2) - 0usize];
    ["Offset of field: arch_vcpu_info::pad"][::std::mem::offset_of!(arch_vcpu_info, pad) - 8usize];
};
pub type arch_vcpu_info_t = arch_vcpu_info;
pub type xen_callback_t = ::std::os::raw::c_ulong;
pub type xen_pfn_t = ::std::os::raw::c_ulong;
pub type xen_ulong_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct trap_info {
    pub vector: u8,
    pub flags: u8,
    pub cs: u16,
    pub address: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of trap_info"][::std::mem::size_of::<trap_info>() - 16usize];
    ["Alignment of trap_info"][::std::mem::align_of::<trap_info>() - 8usize];
    ["Offset of field: trap_info::vector"][::std::mem::offset_of!(trap_info, vector) - 0usize];
    ["Offset of field: trap_info::flags"][::std::mem::offset_of!(trap_info, flags) - 1usize];
    ["Offset of field: trap_info::cs"][::std::mem::offset_of!(trap_info, cs) - 2usize];
    ["Offset of field: trap_info::address"][::std::mem::offset_of!(trap_info, address) - 8usize];
};
pub type trap_info_t = trap_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_trap_info_t {
    pub p: *mut trap_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_trap_info_t"]
        [::std::mem::size_of::<__guest_handle_trap_info_t>() - 8usize];
    ["Alignment of __guest_handle_trap_info_t"]
        [::std::mem::align_of::<__guest_handle_trap_info_t>() - 8usize];
    ["Offset of field: __guest_handle_trap_info_t::p"]
        [::std::mem::offset_of!(__guest_handle_trap_info_t, p) - 0usize];
};
impl Default for __guest_handle_trap_info_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_trap_info_t {
    pub p: *const trap_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_trap_info_t"]
        [::std::mem::size_of::<__guest_handle_const_trap_info_t>() - 8usize];
    ["Alignment of __guest_handle_const_trap_info_t"]
        [::std::mem::align_of::<__guest_handle_const_trap_info_t>() - 8usize];
    ["Offset of field: __guest_handle_const_trap_info_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_trap_info_t, p) - 0usize];
};
impl Default for __guest_handle_const_trap_info_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type tsc_timestamp_t = u64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vcpu_guest_context {
    pub fpu_ctxt: vcpu_guest_context__bindgen_ty_1,
    pub flags: ::std::os::raw::c_ulong,
    pub user_regs: cpu_user_regs,
    pub trap_ctxt: [trap_info; 256usize],
    pub ldt_base: ::std::os::raw::c_ulong,
    pub ldt_ents: ::std::os::raw::c_ulong,
    pub gdt_frames: [::std::os::raw::c_ulong; 16usize],
    pub gdt_ents: ::std::os::raw::c_ulong,
    pub kernel_ss: ::std::os::raw::c_ulong,
    pub kernel_sp: ::std::os::raw::c_ulong,
    pub ctrlreg: [::std::os::raw::c_ulong; 8usize],
    pub debugreg: [::std::os::raw::c_ulong; 8usize],
    pub event_callback_eip: ::std::os::raw::c_ulong,
    pub failsafe_callback_eip: ::std::os::raw::c_ulong,
    pub syscall_callback_eip: ::std::os::raw::c_ulong,
    pub vm_assist: ::std::os::raw::c_ulong,
    pub fs_base: u64,
    pub gs_base_kernel: u64,
    pub gs_base_user: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vcpu_guest_context__bindgen_ty_1 {
    pub x: [::std::os::raw::c_char; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vcpu_guest_context__bindgen_ty_1"]
        [::std::mem::size_of::<vcpu_guest_context__bindgen_ty_1>() - 512usize];
    ["Alignment of vcpu_guest_context__bindgen_ty_1"]
        [::std::mem::align_of::<vcpu_guest_context__bindgen_ty_1>() - 1usize];
    ["Offset of field: vcpu_guest_context__bindgen_ty_1::x"]
        [::std::mem::offset_of!(vcpu_guest_context__bindgen_ty_1, x) - 0usize];
};
impl Default for vcpu_guest_context__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vcpu_guest_context"][::std::mem::size_of::<vcpu_guest_context>() - 5168usize];
    ["Alignment of vcpu_guest_context"][::std::mem::align_of::<vcpu_guest_context>() - 8usize];
    ["Offset of field: vcpu_guest_context::fpu_ctxt"]
        [::std::mem::offset_of!(vcpu_guest_context, fpu_ctxt) - 0usize];
    ["Offset of field: vcpu_guest_context::flags"]
        [::std::mem::offset_of!(vcpu_guest_context, flags) - 512usize];
    ["Offset of field: vcpu_guest_context::user_regs"]
        [::std::mem::offset_of!(vcpu_guest_context, user_regs) - 520usize];
    ["Offset of field: vcpu_guest_context::trap_ctxt"]
        [::std::mem::offset_of!(vcpu_guest_context, trap_ctxt) - 720usize];
    ["Offset of field: vcpu_guest_context::ldt_base"]
        [::std::mem::offset_of!(vcpu_guest_context, ldt_base) - 4816usize];
    ["Offset of field: vcpu_guest_context::ldt_ents"]
        [::std::mem::offset_of!(vcpu_guest_context, ldt_ents) - 4824usize];
    ["Offset of field: vcpu_guest_context::gdt_frames"]
        [::std::mem::offset_of!(vcpu_guest_context, gdt_frames) - 4832usize];
    ["Offset of field: vcpu_guest_context::gdt_ents"]
        [::std::mem::offset_of!(vcpu_guest_context, gdt_ents) - 4960usize];
    ["Offset of field: vcpu_guest_context::kernel_ss"]
        [::std::mem::offset_of!(vcpu_guest_context, kernel_ss) - 4968usize];
    ["Offset of field: vcpu_guest_context::kernel_sp"]
        [::std::mem::offset_of!(vcpu_guest_context, kernel_sp) - 4976usize];
    ["Offset of field: vcpu_guest_context::ctrlreg"]
        [::std::mem::offset_of!(vcpu_guest_context, ctrlreg) - 4984usize];
    ["Offset of field: vcpu_guest_context::debugreg"]
        [::std::mem::offset_of!(vcpu_guest_context, debugreg) - 5048usize];
    ["Offset of field: vcpu_guest_context::event_callback_eip"]
        [::std::mem::offset_of!(vcpu_guest_context, event_callback_eip) - 5112usize];
    ["Offset of field: vcpu_guest_context::failsafe_callback_eip"]
        [::std::mem::offset_of!(vcpu_guest_context, failsafe_callback_eip) - 5120usize];
    ["Offset of field: vcpu_guest_context::syscall_callback_eip"]
        [::std::mem::offset_of!(vcpu_guest_context, syscall_callback_eip) - 5128usize];
    ["Offset of field: vcpu_guest_context::vm_assist"]
        [::std::mem::offset_of!(vcpu_guest_context, vm_assist) - 5136usize];
    ["Offset of field: vcpu_guest_context::fs_base"]
        [::std::mem::offset_of!(vcpu_guest_context, fs_base) - 5144usize];
    ["Offset of field: vcpu_guest_context::gs_base_kernel"]
        [::std::mem::offset_of!(vcpu_guest_context, gs_base_kernel) - 5152usize];
    ["Offset of field: vcpu_guest_context::gs_base_user"]
        [::std::mem::offset_of!(vcpu_guest_context, gs_base_user) - 5160usize];
};
impl Default for vcpu_guest_context {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type vcpu_guest_context_t = vcpu_guest_context;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_vcpu_guest_context_t {
    pub p: *mut vcpu_guest_context_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_vcpu_guest_context_t"]
        [::std::mem::size_of::<__guest_handle_vcpu_guest_context_t>() - 8usize];
    ["Alignment of __guest_handle_vcpu_guest_context_t"]
        [::std::mem::align_of::<__guest_handle_vcpu_guest_context_t>() - 8usize];
    ["Offset of field: __guest_handle_vcpu_guest_context_t::p"]
        [::std::mem::offset_of!(__guest_handle_vcpu_guest_context_t, p) - 0usize];
};
impl Default for __guest_handle_vcpu_guest_context_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_vcpu_guest_context_t {
    pub p: *const vcpu_guest_context_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_vcpu_guest_context_t"]
        [::std::mem::size_of::<__guest_handle_const_vcpu_guest_context_t>() - 8usize];
    ["Alignment of __guest_handle_const_vcpu_guest_context_t"]
        [::std::mem::align_of::<__guest_handle_const_vcpu_guest_context_t>() - 8usize];
    ["Offset of field: __guest_handle_const_vcpu_guest_context_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_vcpu_guest_context_t, p) - 0usize];
};
impl Default for __guest_handle_const_vcpu_guest_context_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct arch_shared_info {
    pub max_pfn: ::std::os::raw::c_ulong,
    pub pfn_to_mfn_frame_list_list: xen_pfn_t,
    pub nmi_reason: ::std::os::raw::c_ulong,
    pub p2m_cr3: ::std::os::raw::c_ulong,
    pub p2m_vaddr: ::std::os::raw::c_ulong,
    pub p2m_generation: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arch_shared_info"][::std::mem::size_of::<arch_shared_info>() - 48usize];
    ["Alignment of arch_shared_info"][::std::mem::align_of::<arch_shared_info>() - 8usize];
    ["Offset of field: arch_shared_info::max_pfn"]
        [::std::mem::offset_of!(arch_shared_info, max_pfn) - 0usize];
    ["Offset of field: arch_shared_info::pfn_to_mfn_frame_list_list"]
        [::std::mem::offset_of!(arch_shared_info, pfn_to_mfn_frame_list_list) - 8usize];
    ["Offset of field: arch_shared_info::nmi_reason"]
        [::std::mem::offset_of!(arch_shared_info, nmi_reason) - 16usize];
    ["Offset of field: arch_shared_info::p2m_cr3"]
        [::std::mem::offset_of!(arch_shared_info, p2m_cr3) - 24usize];
    ["Offset of field: arch_shared_info::p2m_vaddr"]
        [::std::mem::offset_of!(arch_shared_info, p2m_vaddr) - 32usize];
    ["Offset of field: arch_shared_info::p2m_generation"]
        [::std::mem::offset_of!(arch_shared_info, p2m_generation) - 40usize];
};
pub type arch_shared_info_t = arch_shared_info;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct xen_arch_domainconfig {
    pub emulation_flags: u32,
    pub misc_flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xen_arch_domainconfig"][::std::mem::size_of::<xen_arch_domainconfig>() - 8usize];
    ["Alignment of xen_arch_domainconfig"]
        [::std::mem::align_of::<xen_arch_domainconfig>() - 4usize];
    ["Offset of field: xen_arch_domainconfig::emulation_flags"]
        [::std::mem::offset_of!(xen_arch_domainconfig, emulation_flags) - 0usize];
    ["Offset of field: xen_arch_domainconfig::misc_flags"]
        [::std::mem::offset_of!(xen_arch_domainconfig, misc_flags) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct xen_cpuid_leaf {
    pub leaf: u32,
    pub subleaf: u32,
    pub a: u32,
    pub b: u32,
    pub c: u32,
    pub d: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xen_cpuid_leaf"][::std::mem::size_of::<xen_cpuid_leaf>() - 24usize];
    ["Alignment of xen_cpuid_leaf"][::std::mem::align_of::<xen_cpuid_leaf>() - 4usize];
    ["Offset of field: xen_cpuid_leaf::leaf"]
        [::std::mem::offset_of!(xen_cpuid_leaf, leaf) - 0usize];
    ["Offset of field: xen_cpuid_leaf::subleaf"]
        [::std::mem::offset_of!(xen_cpuid_leaf, subleaf) - 4usize];
    ["Offset of field: xen_cpuid_leaf::a"][::std::mem::offset_of!(xen_cpuid_leaf, a) - 8usize];
    ["Offset of field: xen_cpuid_leaf::b"][::std::mem::offset_of!(xen_cpuid_leaf, b) - 12usize];
    ["Offset of field: xen_cpuid_leaf::c"][::std::mem::offset_of!(xen_cpuid_leaf, c) - 16usize];
    ["Offset of field: xen_cpuid_leaf::d"][::std::mem::offset_of!(xen_cpuid_leaf, d) - 20usize];
};
pub type xen_cpuid_leaf_t = xen_cpuid_leaf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_xen_cpuid_leaf_t {
    pub p: *mut xen_cpuid_leaf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_xen_cpuid_leaf_t"]
        [::std::mem::size_of::<__guest_handle_xen_cpuid_leaf_t>() - 8usize];
    ["Alignment of __guest_handle_xen_cpuid_leaf_t"]
        [::std::mem::align_of::<__guest_handle_xen_cpuid_leaf_t>() - 8usize];
    ["Offset of field: __guest_handle_xen_cpuid_leaf_t::p"]
        [::std::mem::offset_of!(__guest_handle_xen_cpuid_leaf_t, p) - 0usize];
};
impl Default for __guest_handle_xen_cpuid_leaf_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_xen_cpuid_leaf_t {
    pub p: *const xen_cpuid_leaf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_xen_cpuid_leaf_t"]
        [::std::mem::size_of::<__guest_handle_const_xen_cpuid_leaf_t>() - 8usize];
    ["Alignment of __guest_handle_const_xen_cpuid_leaf_t"]
        [::std::mem::align_of::<__guest_handle_const_xen_cpuid_leaf_t>() - 8usize];
    ["Offset of field: __guest_handle_const_xen_cpuid_leaf_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_xen_cpuid_leaf_t, p) - 0usize];
};
impl Default for __guest_handle_const_xen_cpuid_leaf_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct xen_msr_entry {
    pub idx: u32,
    pub flags: u32,
    pub val: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xen_msr_entry"][::std::mem::size_of::<xen_msr_entry>() - 16usize];
    ["Alignment of xen_msr_entry"][::std::mem::align_of::<xen_msr_entry>() - 8usize];
    ["Offset of field: xen_msr_entry::idx"][::std::mem::offset_of!(xen_msr_entry, idx) - 0usize];
    ["Offset of field: xen_msr_entry::flags"]
        [::std::mem::offset_of!(xen_msr_entry, flags) - 4usize];
    ["Offset of field: xen_msr_entry::val"][::std::mem::offset_of!(xen_msr_entry, val) - 8usize];
};
pub type xen_msr_entry_t = xen_msr_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_xen_msr_entry_t {
    pub p: *mut xen_msr_entry_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_xen_msr_entry_t"]
        [::std::mem::size_of::<__guest_handle_xen_msr_entry_t>() - 8usize];
    ["Alignment of __guest_handle_xen_msr_entry_t"]
        [::std::mem::align_of::<__guest_handle_xen_msr_entry_t>() - 8usize];
    ["Offset of field: __guest_handle_xen_msr_entry_t::p"]
        [::std::mem::offset_of!(__guest_handle_xen_msr_entry_t, p) - 0usize];
};
impl Default for __guest_handle_xen_msr_entry_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_xen_msr_entry_t {
    pub p: *const xen_msr_entry_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_xen_msr_entry_t"]
        [::std::mem::size_of::<__guest_handle_const_xen_msr_entry_t>() - 8usize];
    ["Alignment of __guest_handle_const_xen_msr_entry_t"]
        [::std::mem::align_of::<__guest_handle_const_xen_msr_entry_t>() - 8usize];
    ["Offset of field: __guest_handle_const_xen_msr_entry_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_xen_msr_entry_t, p) - 0usize];
};
impl Default for __guest_handle_const_xen_msr_entry_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_char {
    pub p: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_char"][::std::mem::size_of::<__guest_handle_char>() - 8usize];
    ["Alignment of __guest_handle_char"][::std::mem::align_of::<__guest_handle_char>() - 8usize];
    ["Offset of field: __guest_handle_char::p"]
        [::std::mem::offset_of!(__guest_handle_char, p) - 0usize];
};
impl Default for __guest_handle_char {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_char {
    pub p: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_char"]
        [::std::mem::size_of::<__guest_handle_const_char>() - 8usize];
    ["Alignment of __guest_handle_const_char"]
        [::std::mem::align_of::<__guest_handle_const_char>() - 8usize];
    ["Offset of field: __guest_handle_const_char::p"]
        [::std::mem::offset_of!(__guest_handle_const_char, p) - 0usize];
};
impl Default for __guest_handle_const_char {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uchar {
    pub p: *mut ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_uchar"][::std::mem::size_of::<__guest_handle_uchar>() - 8usize];
    ["Alignment of __guest_handle_uchar"][::std::mem::align_of::<__guest_handle_uchar>() - 8usize];
    ["Offset of field: __guest_handle_uchar::p"]
        [::std::mem::offset_of!(__guest_handle_uchar, p) - 0usize];
};
impl Default for __guest_handle_uchar {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uchar {
    pub p: *const ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_uchar"]
        [::std::mem::size_of::<__guest_handle_const_uchar>() - 8usize];
    ["Alignment of __guest_handle_const_uchar"]
        [::std::mem::align_of::<__guest_handle_const_uchar>() - 8usize];
    ["Offset of field: __guest_handle_const_uchar::p"]
        [::std::mem::offset_of!(__guest_handle_const_uchar, p) - 0usize];
};
impl Default for __guest_handle_const_uchar {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_int {
    pub p: *mut ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_int"][::std::mem::size_of::<__guest_handle_int>() - 8usize];
    ["Alignment of __guest_handle_int"][::std::mem::align_of::<__guest_handle_int>() - 8usize];
    ["Offset of field: __guest_handle_int::p"]
        [::std::mem::offset_of!(__guest_handle_int, p) - 0usize];
};
impl Default for __guest_handle_int {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_int {
    pub p: *const ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_int"]
        [::std::mem::size_of::<__guest_handle_const_int>() - 8usize];
    ["Alignment of __guest_handle_const_int"]
        [::std::mem::align_of::<__guest_handle_const_int>() - 8usize];
    ["Offset of field: __guest_handle_const_int::p"]
        [::std::mem::offset_of!(__guest_handle_const_int, p) - 0usize];
};
impl Default for __guest_handle_const_int {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint {
    pub p: *mut ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_uint"][::std::mem::size_of::<__guest_handle_uint>() - 8usize];
    ["Alignment of __guest_handle_uint"][::std::mem::align_of::<__guest_handle_uint>() - 8usize];
    ["Offset of field: __guest_handle_uint::p"]
        [::std::mem::offset_of!(__guest_handle_uint, p) - 0usize];
};
impl Default for __guest_handle_uint {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint {
    pub p: *const ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_uint"]
        [::std::mem::size_of::<__guest_handle_const_uint>() - 8usize];
    ["Alignment of __guest_handle_const_uint"]
        [::std::mem::align_of::<__guest_handle_const_uint>() - 8usize];
    ["Offset of field: __guest_handle_const_uint::p"]
        [::std::mem::offset_of!(__guest_handle_const_uint, p) - 0usize];
};
impl Default for __guest_handle_const_uint {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_void {
    pub p: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_void"][::std::mem::size_of::<__guest_handle_void>() - 8usize];
    ["Alignment of __guest_handle_void"][::std::mem::align_of::<__guest_handle_void>() - 8usize];
    ["Offset of field: __guest_handle_void::p"]
        [::std::mem::offset_of!(__guest_handle_void, p) - 0usize];
};
impl Default for __guest_handle_void {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_void {
    pub p: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_void"]
        [::std::mem::size_of::<__guest_handle_const_void>() - 8usize];
    ["Alignment of __guest_handle_const_void"]
        [::std::mem::align_of::<__guest_handle_const_void>() - 8usize];
    ["Offset of field: __guest_handle_const_void::p"]
        [::std::mem::offset_of!(__guest_handle_const_void, p) - 0usize];
};
impl Default for __guest_handle_const_void {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint64_t {
    pub p: *mut u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_uint64_t"][::std::mem::size_of::<__guest_handle_uint64_t>() - 8usize];
    ["Alignment of __guest_handle_uint64_t"]
        [::std::mem::align_of::<__guest_handle_uint64_t>() - 8usize];
    ["Offset of field: __guest_handle_uint64_t::p"]
        [::std::mem::offset_of!(__guest_handle_uint64_t, p) - 0usize];
};
impl Default for __guest_handle_uint64_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint64_t {
    pub p: *const u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_uint64_t"]
        [::std::mem::size_of::<__guest_handle_const_uint64_t>() - 8usize];
    ["Alignment of __guest_handle_const_uint64_t"]
        [::std::mem::align_of::<__guest_handle_const_uint64_t>() - 8usize];
    ["Offset of field: __guest_handle_const_uint64_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_uint64_t, p) - 0usize];
};
impl Default for __guest_handle_const_uint64_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_xen_pfn_t {
    pub p: *mut xen_pfn_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_xen_pfn_t"]
        [::std::mem::size_of::<__guest_handle_xen_pfn_t>() - 8usize];
    ["Alignment of __guest_handle_xen_pfn_t"]
        [::std::mem::align_of::<__guest_handle_xen_pfn_t>() - 8usize];
    ["Offset of field: __guest_handle_xen_pfn_t::p"]
        [::std::mem::offset_of!(__guest_handle_xen_pfn_t, p) - 0usize];
};
impl Default for __guest_handle_xen_pfn_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_xen_pfn_t {
    pub p: *const xen_pfn_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_xen_pfn_t"]
        [::std::mem::size_of::<__guest_handle_const_xen_pfn_t>() - 8usize];
    ["Alignment of __guest_handle_const_xen_pfn_t"]
        [::std::mem::align_of::<__guest_handle_const_xen_pfn_t>() - 8usize];
    ["Offset of field: __guest_handle_const_xen_pfn_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_xen_pfn_t, p) - 0usize];
};
impl Default for __guest_handle_const_xen_pfn_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_xen_ulong_t {
    pub p: *mut xen_ulong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_xen_ulong_t"]
        [::std::mem::size_of::<__guest_handle_xen_ulong_t>() - 8usize];
    ["Alignment of __guest_handle_xen_ulong_t"]
        [::std::mem::align_of::<__guest_handle_xen_ulong_t>() - 8usize];
    ["Offset of field: __guest_handle_xen_ulong_t::p"]
        [::std::mem::offset_of!(__guest_handle_xen_ulong_t, p) - 0usize];
};
impl Default for __guest_handle_xen_ulong_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_xen_ulong_t {
    pub p: *const xen_ulong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_xen_ulong_t"]
        [::std::mem::size_of::<__guest_handle_const_xen_ulong_t>() - 8usize];
    ["Alignment of __guest_handle_const_xen_ulong_t"]
        [::std::mem::align_of::<__guest_handle_const_xen_ulong_t>() - 8usize];
    ["Offset of field: __guest_handle_const_xen_ulong_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_xen_ulong_t, p) - 0usize];
};
impl Default for __guest_handle_const_xen_ulong_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mmuext_op {
    pub cmd: ::std::os::raw::c_uint,
    pub arg1: mmuext_op__bindgen_ty_1,
    pub arg2: mmuext_op__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_1 {
    pub mfn: xen_pfn_t,
    pub linear_addr: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mmuext_op__bindgen_ty_1"][::std::mem::size_of::<mmuext_op__bindgen_ty_1>() - 8usize];
    ["Alignment of mmuext_op__bindgen_ty_1"]
        [::std::mem::align_of::<mmuext_op__bindgen_ty_1>() - 8usize];
    ["Offset of field: mmuext_op__bindgen_ty_1::mfn"]
        [::std::mem::offset_of!(mmuext_op__bindgen_ty_1, mfn) - 0usize];
    ["Offset of field: mmuext_op__bindgen_ty_1::linear_addr"]
        [::std::mem::offset_of!(mmuext_op__bindgen_ty_1, linear_addr) - 0usize];
};
impl Default for mmuext_op__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_2 {
    pub nr_ents: ::std::os::raw::c_uint,
    pub vcpumask: __guest_handle_const_void,
    pub src_mfn: xen_pfn_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mmuext_op__bindgen_ty_2"][::std::mem::size_of::<mmuext_op__bindgen_ty_2>() - 8usize];
    ["Alignment of mmuext_op__bindgen_ty_2"]
        [::std::mem::align_of::<mmuext_op__bindgen_ty_2>() - 8usize];
    ["Offset of field: mmuext_op__bindgen_ty_2::nr_ents"]
        [::std::mem::offset_of!(mmuext_op__bindgen_ty_2, nr_ents) - 0usize];
    ["Offset of field: mmuext_op__bindgen_ty_2::vcpumask"]
        [::std::mem::offset_of!(mmuext_op__bindgen_ty_2, vcpumask) - 0usize];
    ["Offset of field: mmuext_op__bindgen_ty_2::src_mfn"]
        [::std::mem::offset_of!(mmuext_op__bindgen_ty_2, src_mfn) - 0usize];
};
impl Default for mmuext_op__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mmuext_op"][::std::mem::size_of::<mmuext_op>() - 24usize];
    ["Alignment of mmuext_op"][::std::mem::align_of::<mmuext_op>() - 8usize];
    ["Offset of field: mmuext_op::cmd"][::std::mem::offset_of!(mmuext_op, cmd) - 0usize];
    ["Offset of field: mmuext_op::arg1"][::std::mem::offset_of!(mmuext_op, arg1) - 8usize];
    ["Offset of field: mmuext_op::arg2"][::std::mem::offset_of!(mmuext_op, arg2) - 16usize];
};
impl Default for mmuext_op {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mmuext_op_t = mmuext_op;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_mmuext_op_t {
    pub p: *mut mmuext_op_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_mmuext_op_t"]
        [::std::mem::size_of::<__guest_handle_mmuext_op_t>() - 8usize];
    ["Alignment of __guest_handle_mmuext_op_t"]
        [::std::mem::align_of::<__guest_handle_mmuext_op_t>() - 8usize];
    ["Offset of field: __guest_handle_mmuext_op_t::p"]
        [::std::mem::offset_of!(__guest_handle_mmuext_op_t, p) - 0usize];
};
impl Default for __guest_handle_mmuext_op_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_mmuext_op_t {
    pub p: *const mmuext_op_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_mmuext_op_t"]
        [::std::mem::size_of::<__guest_handle_const_mmuext_op_t>() - 8usize];
    ["Alignment of __guest_handle_const_mmuext_op_t"]
        [::std::mem::align_of::<__guest_handle_const_mmuext_op_t>() - 8usize];
    ["Offset of field: __guest_handle_const_mmuext_op_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_mmuext_op_t, p) - 0usize];
};
impl Default for __guest_handle_const_mmuext_op_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type domid_t = u16;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mmu_update {
    pub ptr: u64,
    pub val: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mmu_update"][::std::mem::size_of::<mmu_update>() - 16usize];
    ["Alignment of mmu_update"][::std::mem::align_of::<mmu_update>() - 8usize];
    ["Offset of field: mmu_update::ptr"][::std::mem::offset_of!(mmu_update, ptr) - 0usize];
    ["Offset of field: mmu_update::val"][::std::mem::offset_of!(mmu_update, val) - 8usize];
};
pub type mmu_update_t = mmu_update;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_mmu_update_t {
    pub p: *mut mmu_update_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_mmu_update_t"]
        [::std::mem::size_of::<__guest_handle_mmu_update_t>() - 8usize];
    ["Alignment of __guest_handle_mmu_update_t"]
        [::std::mem::align_of::<__guest_handle_mmu_update_t>() - 8usize];
    ["Offset of field: __guest_handle_mmu_update_t::p"]
        [::std::mem::offset_of!(__guest_handle_mmu_update_t, p) - 0usize];
};
impl Default for __guest_handle_mmu_update_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_mmu_update_t {
    pub p: *const mmu_update_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_mmu_update_t"]
        [::std::mem::size_of::<__guest_handle_const_mmu_update_t>() - 8usize];
    ["Alignment of __guest_handle_const_mmu_update_t"]
        [::std::mem::align_of::<__guest_handle_const_mmu_update_t>() - 8usize];
    ["Offset of field: __guest_handle_const_mmu_update_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_mmu_update_t, p) - 0usize];
};
impl Default for __guest_handle_const_mmu_update_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct multicall_entry {
    pub op: xen_ulong_t,
    pub result: xen_ulong_t,
    pub args: [xen_ulong_t; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of multicall_entry"][::std::mem::size_of::<multicall_entry>() - 64usize];
    ["Alignment of multicall_entry"][::std::mem::align_of::<multicall_entry>() - 8usize];
    ["Offset of field: multicall_entry::op"][::std::mem::offset_of!(multicall_entry, op) - 0usize];
    ["Offset of field: multicall_entry::result"]
        [::std::mem::offset_of!(multicall_entry, result) - 8usize];
    ["Offset of field: multicall_entry::args"]
        [::std::mem::offset_of!(multicall_entry, args) - 16usize];
};
pub type multicall_entry_t = multicall_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_multicall_entry_t {
    pub p: *mut multicall_entry_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_multicall_entry_t"]
        [::std::mem::size_of::<__guest_handle_multicall_entry_t>() - 8usize];
    ["Alignment of __guest_handle_multicall_entry_t"]
        [::std::mem::align_of::<__guest_handle_multicall_entry_t>() - 8usize];
    ["Offset of field: __guest_handle_multicall_entry_t::p"]
        [::std::mem::offset_of!(__guest_handle_multicall_entry_t, p) - 0usize];
};
impl Default for __guest_handle_multicall_entry_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_multicall_entry_t {
    pub p: *const multicall_entry_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_multicall_entry_t"]
        [::std::mem::size_of::<__guest_handle_const_multicall_entry_t>() - 8usize];
    ["Alignment of __guest_handle_const_multicall_entry_t"]
        [::std::mem::align_of::<__guest_handle_const_multicall_entry_t>() - 8usize];
    ["Offset of field: __guest_handle_const_multicall_entry_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_multicall_entry_t, p) - 0usize];
};
impl Default for __guest_handle_const_multicall_entry_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct vcpu_time_info {
    pub version: u32,
    pub pad0: u32,
    pub tsc_timestamp: u64,
    pub system_time: u64,
    pub tsc_to_system_mul: u32,
    pub tsc_shift: i8,
    pub flags: u8,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vcpu_time_info"][::std::mem::size_of::<vcpu_time_info>() - 32usize];
    ["Alignment of vcpu_time_info"][::std::mem::align_of::<vcpu_time_info>() - 8usize];
    ["Offset of field: vcpu_time_info::version"]
        [::std::mem::offset_of!(vcpu_time_info, version) - 0usize];
    ["Offset of field: vcpu_time_info::pad0"]
        [::std::mem::offset_of!(vcpu_time_info, pad0) - 4usize];
    ["Offset of field: vcpu_time_info::tsc_timestamp"]
        [::std::mem::offset_of!(vcpu_time_info, tsc_timestamp) - 8usize];
    ["Offset of field: vcpu_time_info::system_time"]
        [::std::mem::offset_of!(vcpu_time_info, system_time) - 16usize];
    ["Offset of field: vcpu_time_info::tsc_to_system_mul"]
        [::std::mem::offset_of!(vcpu_time_info, tsc_to_system_mul) - 24usize];
    ["Offset of field: vcpu_time_info::tsc_shift"]
        [::std::mem::offset_of!(vcpu_time_info, tsc_shift) - 28usize];
    ["Offset of field: vcpu_time_info::flags"]
        [::std::mem::offset_of!(vcpu_time_info, flags) - 29usize];
    ["Offset of field: vcpu_time_info::pad1"]
        [::std::mem::offset_of!(vcpu_time_info, pad1) - 30usize];
};
pub type vcpu_time_info_t = vcpu_time_info;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct vcpu_info {
    pub evtchn_upcall_pending: u8,
    pub evtchn_upcall_mask: u8,
    pub evtchn_pending_sel: xen_ulong_t,
    pub arch: arch_vcpu_info,
    pub time: vcpu_time_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vcpu_info"][::std::mem::size_of::<vcpu_info>() - 64usize];
    ["Alignment of vcpu_info"][::std::mem::align_of::<vcpu_info>() - 8usize];
    ["Offset of field: vcpu_info::evtchn_upcall_pending"]
        [::std::mem::offset_of!(vcpu_info, evtchn_upcall_pending) - 0usize];
    ["Offset of field: vcpu_info::evtchn_upcall_mask"]
        [::std::mem::offset_of!(vcpu_info, evtchn_upcall_mask) - 1usize];
    ["Offset of field: vcpu_info::evtchn_pending_sel"]
        [::std::mem::offset_of!(vcpu_info, evtchn_pending_sel) - 8usize];
    ["Offset of field: vcpu_info::arch"][::std::mem::offset_of!(vcpu_info, arch) - 16usize];
    ["Offset of field: vcpu_info::time"][::std::mem::offset_of!(vcpu_info, time) - 32usize];
};
pub type vcpu_info_t = vcpu_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct shared_info {
    pub vcpu_info: [vcpu_info; 32usize],
    pub evtchn_pending: [xen_ulong_t; 64usize],
    pub evtchn_mask: [xen_ulong_t; 64usize],
    pub wc_version: u32,
    pub wc_sec: u32,
    pub wc_nsec: u32,
    pub wc_sec_hi: u32,
    pub arch: arch_shared_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of shared_info"][::std::mem::size_of::<shared_info>() - 3136usize];
    ["Alignment of shared_info"][::std::mem::align_of::<shared_info>() - 8usize];
    ["Offset of field: shared_info::vcpu_info"]
        [::std::mem::offset_of!(shared_info, vcpu_info) - 0usize];
    ["Offset of field: shared_info::evtchn_pending"]
        [::std::mem::offset_of!(shared_info, evtchn_pending) - 2048usize];
    ["Offset of field: shared_info::evtchn_mask"]
        [::std::mem::offset_of!(shared_info, evtchn_mask) - 2560usize];
    ["Offset of field: shared_info::wc_version"]
        [::std::mem::offset_of!(shared_info, wc_version) - 3072usize];
    ["Offset of field: shared_info::wc_sec"]
        [::std::mem::offset_of!(shared_info, wc_sec) - 3076usize];
    ["Offset of field: shared_info::wc_nsec"]
        [::std::mem::offset_of!(shared_info, wc_nsec) - 3080usize];
    ["Offset of field: shared_info::wc_sec_hi"]
        [::std::mem::offset_of!(shared_info, wc_sec_hi) - 3084usize];
    ["Offset of field: shared_info::arch"][::std::mem::offset_of!(shared_info, arch) - 3088usize];
};
impl Default for shared_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type shared_info_t = shared_info;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct start_info {
    pub magic: [::std::os::raw::c_char; 32usize],
    pub nr_pages: ::std::os::raw::c_ulong,
    pub shared_info: ::std::os::raw::c_ulong,
    pub flags: u32,
    pub store_mfn: xen_pfn_t,
    pub store_evtchn: u32,
    pub console: start_info__bindgen_ty_1,
    pub pt_base: ::std::os::raw::c_ulong,
    pub nr_pt_frames: ::std::os::raw::c_ulong,
    pub mfn_list: ::std::os::raw::c_ulong,
    pub mod_start: ::std::os::raw::c_ulong,
    pub mod_len: ::std::os::raw::c_ulong,
    pub cmd_line: [i8; 1024usize],
    pub first_p2m_pfn: ::std::os::raw::c_ulong,
    pub nr_p2m_frames: ::std::os::raw::c_ulong,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union start_info__bindgen_ty_1 {
    pub domU: start_info__bindgen_ty_1__bindgen_ty_1,
    pub dom0: start_info__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct start_info__bindgen_ty_1__bindgen_ty_1 {
    pub mfn: xen_pfn_t,
    pub evtchn: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of start_info__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<start_info__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of start_info__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<start_info__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: start_info__bindgen_ty_1__bindgen_ty_1::mfn"]
        [::std::mem::offset_of!(start_info__bindgen_ty_1__bindgen_ty_1, mfn) - 0usize];
    ["Offset of field: start_info__bindgen_ty_1__bindgen_ty_1::evtchn"]
        [::std::mem::offset_of!(start_info__bindgen_ty_1__bindgen_ty_1, evtchn) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct start_info__bindgen_ty_1__bindgen_ty_2 {
    pub info_off: u32,
    pub info_size: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of start_info__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<start_info__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of start_info__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<start_info__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: start_info__bindgen_ty_1__bindgen_ty_2::info_off"]
        [::std::mem::offset_of!(start_info__bindgen_ty_1__bindgen_ty_2, info_off) - 0usize];
    ["Offset of field: start_info__bindgen_ty_1__bindgen_ty_2::info_size"]
        [::std::mem::offset_of!(start_info__bindgen_ty_1__bindgen_ty_2, info_size) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of start_info__bindgen_ty_1"]
        [::std::mem::size_of::<start_info__bindgen_ty_1>() - 16usize];
    ["Alignment of start_info__bindgen_ty_1"]
        [::std::mem::align_of::<start_info__bindgen_ty_1>() - 8usize];
    ["Offset of field: start_info__bindgen_ty_1::domU"]
        [::std::mem::offset_of!(start_info__bindgen_ty_1, domU) - 0usize];
    ["Offset of field: start_info__bindgen_ty_1::dom0"]
        [::std::mem::offset_of!(start_info__bindgen_ty_1, dom0) - 0usize];
};
impl Default for start_info__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of start_info"][::std::mem::size_of::<start_info>() - 1168usize];
    ["Alignment of start_info"][::std::mem::align_of::<start_info>() - 8usize];
    ["Offset of field: start_info::magic"][::std::mem::offset_of!(start_info, magic) - 0usize];
    ["Offset of field: start_info::nr_pages"]
        [::std::mem::offset_of!(start_info, nr_pages) - 32usize];
    ["Offset of field: start_info::shared_info"]
        [::std::mem::offset_of!(start_info, shared_info) - 40usize];
    ["Offset of field: start_info::flags"][::std::mem::offset_of!(start_info, flags) - 48usize];
    ["Offset of field: start_info::store_mfn"]
        [::std::mem::offset_of!(start_info, store_mfn) - 56usize];
    ["Offset of field: start_info::store_evtchn"]
        [::std::mem::offset_of!(start_info, store_evtchn) - 64usize];
    ["Offset of field: start_info::console"][::std::mem::offset_of!(start_info, console) - 72usize];
    ["Offset of field: start_info::pt_base"][::std::mem::offset_of!(start_info, pt_base) - 88usize];
    ["Offset of field: start_info::nr_pt_frames"]
        [::std::mem::offset_of!(start_info, nr_pt_frames) - 96usize];
    ["Offset of field: start_info::mfn_list"]
        [::std::mem::offset_of!(start_info, mfn_list) - 104usize];
    ["Offset of field: start_info::mod_start"]
        [::std::mem::offset_of!(start_info, mod_start) - 112usize];
    ["Offset of field: start_info::mod_len"]
        [::std::mem::offset_of!(start_info, mod_len) - 120usize];
    ["Offset of field: start_info::cmd_line"]
        [::std::mem::offset_of!(start_info, cmd_line) - 128usize];
    ["Offset of field: start_info::first_p2m_pfn"]
        [::std::mem::offset_of!(start_info, first_p2m_pfn) - 1152usize];
    ["Offset of field: start_info::nr_p2m_frames"]
        [::std::mem::offset_of!(start_info, nr_p2m_frames) - 1160usize];
};
impl Default for start_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type start_info_t = start_info;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct xen_multiboot_mod_list {
    pub mod_start: u32,
    pub mod_end: u32,
    pub cmdline: u32,
    pub pad: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xen_multiboot_mod_list"][::std::mem::size_of::<xen_multiboot_mod_list>() - 16usize];
    ["Alignment of xen_multiboot_mod_list"]
        [::std::mem::align_of::<xen_multiboot_mod_list>() - 4usize];
    ["Offset of field: xen_multiboot_mod_list::mod_start"]
        [::std::mem::offset_of!(xen_multiboot_mod_list, mod_start) - 0usize];
    ["Offset of field: xen_multiboot_mod_list::mod_end"]
        [::std::mem::offset_of!(xen_multiboot_mod_list, mod_end) - 4usize];
    ["Offset of field: xen_multiboot_mod_list::cmdline"]
        [::std::mem::offset_of!(xen_multiboot_mod_list, cmdline) - 8usize];
    ["Offset of field: xen_multiboot_mod_list::pad"]
        [::std::mem::offset_of!(xen_multiboot_mod_list, pad) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dom0_vga_console_info {
    pub video_type: u8,
    pub u: dom0_vga_console_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dom0_vga_console_info__bindgen_ty_1 {
    pub text_mode_3: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
    pub vesa_lfb: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1 {
    pub font_height: u16,
    pub cursor_x: u16,
    pub cursor_y: u16,
    pub rows: u16,
    pub columns: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>() - 10usize];
    ["Alignment of dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1::font_height"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
        font_height
    ) - 0usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1::cursor_x"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
        cursor_x
    ) - 2usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1::cursor_y"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
        cursor_y
    ) - 4usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1::rows"]
        [::std::mem::offset_of!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1, rows) - 6usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1::columns"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
        columns
    ) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2 {
    pub width: u16,
    pub height: u16,
    pub bytes_per_line: u16,
    pub bits_per_pixel: u16,
    pub lfb_base: u32,
    pub lfb_size: u32,
    pub red_pos: u8,
    pub red_size: u8,
    pub green_pos: u8,
    pub green_size: u8,
    pub blue_pos: u8,
    pub blue_size: u8,
    pub rsvd_pos: u8,
    pub rsvd_size: u8,
    pub gbl_caps: u32,
    pub mode_attrs: u16,
    pub pad: u16,
    pub ext_lfb_base: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>() - 36usize];
    ["Alignment of dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::width"]
        [::std::mem::offset_of!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2, width) - 0usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::height"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        height
    ) - 2usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::bytes_per_line"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        bytes_per_line
    )
        - 4usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::bits_per_pixel"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        bits_per_pixel
    )
        - 6usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::lfb_base"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        lfb_base
    ) - 8usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::lfb_size"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        lfb_size
    ) - 12usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::red_pos"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        red_pos
    ) - 16usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::red_size"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        red_size
    ) - 17usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::green_pos"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        green_pos
    ) - 18usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::green_size"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        green_size
    ) - 19usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::blue_pos"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        blue_pos
    ) - 20usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::blue_size"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        blue_size
    ) - 21usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::rsvd_pos"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        rsvd_pos
    ) - 22usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::rsvd_size"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        rsvd_size
    ) - 23usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::gbl_caps"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        gbl_caps
    ) - 24usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::mode_attrs"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        mode_attrs
    ) - 28usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::pad"]
        [::std::mem::offset_of!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2, pad) - 30usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2::ext_lfb_base"][::std::mem::offset_of!(
        dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
        ext_lfb_base
    )
        - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dom0_vga_console_info__bindgen_ty_1"]
        [::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1>() - 36usize];
    ["Alignment of dom0_vga_console_info__bindgen_ty_1"]
        [::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1>() - 4usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1::text_mode_3"]
        [::std::mem::offset_of!(dom0_vga_console_info__bindgen_ty_1, text_mode_3) - 0usize];
    ["Offset of field: dom0_vga_console_info__bindgen_ty_1::vesa_lfb"]
        [::std::mem::offset_of!(dom0_vga_console_info__bindgen_ty_1, vesa_lfb) - 0usize];
};
impl Default for dom0_vga_console_info__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dom0_vga_console_info"][::std::mem::size_of::<dom0_vga_console_info>() - 40usize];
    ["Alignment of dom0_vga_console_info"]
        [::std::mem::align_of::<dom0_vga_console_info>() - 4usize];
    ["Offset of field: dom0_vga_console_info::video_type"]
        [::std::mem::offset_of!(dom0_vga_console_info, video_type) - 0usize];
    ["Offset of field: dom0_vga_console_info::u"]
        [::std::mem::offset_of!(dom0_vga_console_info, u) - 4usize];
};
impl Default for dom0_vga_console_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type dom0_vga_console_info_t = dom0_vga_console_info;
pub type xen_domain_handle_t = [u8; 16usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint8 {
    pub p: *mut u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_uint8"][::std::mem::size_of::<__guest_handle_uint8>() - 8usize];
    ["Alignment of __guest_handle_uint8"][::std::mem::align_of::<__guest_handle_uint8>() - 8usize];
    ["Offset of field: __guest_handle_uint8::p"]
        [::std::mem::offset_of!(__guest_handle_uint8, p) - 0usize];
};
impl Default for __guest_handle_uint8 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint8 {
    pub p: *const u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_uint8"]
        [::std::mem::size_of::<__guest_handle_const_uint8>() - 8usize];
    ["Alignment of __guest_handle_const_uint8"]
        [::std::mem::align_of::<__guest_handle_const_uint8>() - 8usize];
    ["Offset of field: __guest_handle_const_uint8::p"]
        [::std::mem::offset_of!(__guest_handle_const_uint8, p) - 0usize];
};
impl Default for __guest_handle_const_uint8 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint16 {
    pub p: *mut u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_uint16"][::std::mem::size_of::<__guest_handle_uint16>() - 8usize];
    ["Alignment of __guest_handle_uint16"]
        [::std::mem::align_of::<__guest_handle_uint16>() - 8usize];
    ["Offset of field: __guest_handle_uint16::p"]
        [::std::mem::offset_of!(__guest_handle_uint16, p) - 0usize];
};
impl Default for __guest_handle_uint16 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint16 {
    pub p: *const u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_uint16"]
        [::std::mem::size_of::<__guest_handle_const_uint16>() - 8usize];
    ["Alignment of __guest_handle_const_uint16"]
        [::std::mem::align_of::<__guest_handle_const_uint16>() - 8usize];
    ["Offset of field: __guest_handle_const_uint16::p"]
        [::std::mem::offset_of!(__guest_handle_const_uint16, p) - 0usize];
};
impl Default for __guest_handle_const_uint16 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint32 {
    pub p: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_uint32"][::std::mem::size_of::<__guest_handle_uint32>() - 8usize];
    ["Alignment of __guest_handle_uint32"]
        [::std::mem::align_of::<__guest_handle_uint32>() - 8usize];
    ["Offset of field: __guest_handle_uint32::p"]
        [::std::mem::offset_of!(__guest_handle_uint32, p) - 0usize];
};
impl Default for __guest_handle_uint32 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint32 {
    pub p: *const u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_uint32"]
        [::std::mem::size_of::<__guest_handle_const_uint32>() - 8usize];
    ["Alignment of __guest_handle_const_uint32"]
        [::std::mem::align_of::<__guest_handle_const_uint32>() - 8usize];
    ["Offset of field: __guest_handle_const_uint32::p"]
        [::std::mem::offset_of!(__guest_handle_const_uint32, p) - 0usize];
};
impl Default for __guest_handle_const_uint32 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_uint64 {
    pub p: *mut u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_uint64"][::std::mem::size_of::<__guest_handle_uint64>() - 8usize];
    ["Alignment of __guest_handle_uint64"]
        [::std::mem::align_of::<__guest_handle_uint64>() - 8usize];
    ["Offset of field: __guest_handle_uint64::p"]
        [::std::mem::offset_of!(__guest_handle_uint64, p) - 0usize];
};
impl Default for __guest_handle_uint64 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_uint64 {
    pub p: *const u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_uint64"]
        [::std::mem::size_of::<__guest_handle_const_uint64>() - 8usize];
    ["Alignment of __guest_handle_const_uint64"]
        [::std::mem::align_of::<__guest_handle_const_uint64>() - 8usize];
    ["Offset of field: __guest_handle_const_uint64::p"]
        [::std::mem::offset_of!(__guest_handle_const_uint64, p) - 0usize];
};
impl Default for __guest_handle_const_uint64 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct xen_uuid_t {
    pub a: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xen_uuid_t"][::std::mem::size_of::<xen_uuid_t>() - 16usize];
    ["Alignment of xen_uuid_t"][::std::mem::align_of::<xen_uuid_t>() - 1usize];
    ["Offset of field: xen_uuid_t::a"][::std::mem::offset_of!(xen_uuid_t, a) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xenctl_bitmap {
    pub bitmap: __guest_handle_uint8,
    pub nr_bits: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xenctl_bitmap"][::std::mem::size_of::<xenctl_bitmap>() - 16usize];
    ["Alignment of xenctl_bitmap"][::std::mem::align_of::<xenctl_bitmap>() - 8usize];
    ["Offset of field: xenctl_bitmap::bitmap"]
        [::std::mem::offset_of!(xenctl_bitmap, bitmap) - 0usize];
    ["Offset of field: xenctl_bitmap::nr_bits"]
        [::std::mem::offset_of!(xenctl_bitmap, nr_bits) - 8usize];
};
impl Default for xenctl_bitmap {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type xenctl_bitmap_t = xenctl_bitmap;
pub type evtchn_port_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_evtchn_port_t {
    pub p: *mut evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_evtchn_port_t"]
        [::std::mem::size_of::<__guest_handle_evtchn_port_t>() - 8usize];
    ["Alignment of __guest_handle_evtchn_port_t"]
        [::std::mem::align_of::<__guest_handle_evtchn_port_t>() - 8usize];
    ["Offset of field: __guest_handle_evtchn_port_t::p"]
        [::std::mem::offset_of!(__guest_handle_evtchn_port_t, p) - 0usize];
};
impl Default for __guest_handle_evtchn_port_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_evtchn_port_t {
    pub p: *const evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_evtchn_port_t"]
        [::std::mem::size_of::<__guest_handle_const_evtchn_port_t>() - 8usize];
    ["Alignment of __guest_handle_const_evtchn_port_t"]
        [::std::mem::align_of::<__guest_handle_const_evtchn_port_t>() - 8usize];
    ["Offset of field: __guest_handle_const_evtchn_port_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_evtchn_port_t, p) - 0usize];
};
impl Default for __guest_handle_const_evtchn_port_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_alloc_unbound {
    pub dom: domid_t,
    pub remote_dom: domid_t,
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_alloc_unbound"][::std::mem::size_of::<evtchn_alloc_unbound>() - 8usize];
    ["Alignment of evtchn_alloc_unbound"][::std::mem::align_of::<evtchn_alloc_unbound>() - 4usize];
    ["Offset of field: evtchn_alloc_unbound::dom"]
        [::std::mem::offset_of!(evtchn_alloc_unbound, dom) - 0usize];
    ["Offset of field: evtchn_alloc_unbound::remote_dom"]
        [::std::mem::offset_of!(evtchn_alloc_unbound, remote_dom) - 2usize];
    ["Offset of field: evtchn_alloc_unbound::port"]
        [::std::mem::offset_of!(evtchn_alloc_unbound, port) - 4usize];
};
pub type evtchn_alloc_unbound_t = evtchn_alloc_unbound;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_bind_interdomain {
    pub remote_dom: domid_t,
    pub remote_port: evtchn_port_t,
    pub local_port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_bind_interdomain"][::std::mem::size_of::<evtchn_bind_interdomain>() - 12usize];
    ["Alignment of evtchn_bind_interdomain"]
        [::std::mem::align_of::<evtchn_bind_interdomain>() - 4usize];
    ["Offset of field: evtchn_bind_interdomain::remote_dom"]
        [::std::mem::offset_of!(evtchn_bind_interdomain, remote_dom) - 0usize];
    ["Offset of field: evtchn_bind_interdomain::remote_port"]
        [::std::mem::offset_of!(evtchn_bind_interdomain, remote_port) - 4usize];
    ["Offset of field: evtchn_bind_interdomain::local_port"]
        [::std::mem::offset_of!(evtchn_bind_interdomain, local_port) - 8usize];
};
pub type evtchn_bind_interdomain_t = evtchn_bind_interdomain;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_bind_virq {
    pub virq: u32,
    pub vcpu: u32,
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_bind_virq"][::std::mem::size_of::<evtchn_bind_virq>() - 12usize];
    ["Alignment of evtchn_bind_virq"][::std::mem::align_of::<evtchn_bind_virq>() - 4usize];
    ["Offset of field: evtchn_bind_virq::virq"]
        [::std::mem::offset_of!(evtchn_bind_virq, virq) - 0usize];
    ["Offset of field: evtchn_bind_virq::vcpu"]
        [::std::mem::offset_of!(evtchn_bind_virq, vcpu) - 4usize];
    ["Offset of field: evtchn_bind_virq::port"]
        [::std::mem::offset_of!(evtchn_bind_virq, port) - 8usize];
};
pub type evtchn_bind_virq_t = evtchn_bind_virq;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_bind_pirq {
    pub pirq: u32,
    pub flags: u32,
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_bind_pirq"][::std::mem::size_of::<evtchn_bind_pirq>() - 12usize];
    ["Alignment of evtchn_bind_pirq"][::std::mem::align_of::<evtchn_bind_pirq>() - 4usize];
    ["Offset of field: evtchn_bind_pirq::pirq"]
        [::std::mem::offset_of!(evtchn_bind_pirq, pirq) - 0usize];
    ["Offset of field: evtchn_bind_pirq::flags"]
        [::std::mem::offset_of!(evtchn_bind_pirq, flags) - 4usize];
    ["Offset of field: evtchn_bind_pirq::port"]
        [::std::mem::offset_of!(evtchn_bind_pirq, port) - 8usize];
};
pub type evtchn_bind_pirq_t = evtchn_bind_pirq;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_bind_ipi {
    pub vcpu: u32,
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_bind_ipi"][::std::mem::size_of::<evtchn_bind_ipi>() - 8usize];
    ["Alignment of evtchn_bind_ipi"][::std::mem::align_of::<evtchn_bind_ipi>() - 4usize];
    ["Offset of field: evtchn_bind_ipi::vcpu"]
        [::std::mem::offset_of!(evtchn_bind_ipi, vcpu) - 0usize];
    ["Offset of field: evtchn_bind_ipi::port"]
        [::std::mem::offset_of!(evtchn_bind_ipi, port) - 4usize];
};
pub type evtchn_bind_ipi_t = evtchn_bind_ipi;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_close {
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_close"][::std::mem::size_of::<evtchn_close>() - 4usize];
    ["Alignment of evtchn_close"][::std::mem::align_of::<evtchn_close>() - 4usize];
    ["Offset of field: evtchn_close::port"][::std::mem::offset_of!(evtchn_close, port) - 0usize];
};
pub type evtchn_close_t = evtchn_close;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_send {
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_send"][::std::mem::size_of::<evtchn_send>() - 4usize];
    ["Alignment of evtchn_send"][::std::mem::align_of::<evtchn_send>() - 4usize];
    ["Offset of field: evtchn_send::port"][::std::mem::offset_of!(evtchn_send, port) - 0usize];
};
pub type evtchn_send_t = evtchn_send;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct evtchn_status {
    pub dom: domid_t,
    pub port: evtchn_port_t,
    pub status: u32,
    pub vcpu: u32,
    pub u: evtchn_status__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union evtchn_status__bindgen_ty_1 {
    pub unbound: evtchn_status__bindgen_ty_1__bindgen_ty_1,
    pub interdomain: evtchn_status__bindgen_ty_1__bindgen_ty_2,
    pub pirq: u32,
    pub virq: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_status__bindgen_ty_1__bindgen_ty_1 {
    pub dom: domid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_status__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<evtchn_status__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Alignment of evtchn_status__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<evtchn_status__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: evtchn_status__bindgen_ty_1__bindgen_ty_1::dom"]
        [::std::mem::offset_of!(evtchn_status__bindgen_ty_1__bindgen_ty_1, dom) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_status__bindgen_ty_1__bindgen_ty_2 {
    pub dom: domid_t,
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_status__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<evtchn_status__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of evtchn_status__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<evtchn_status__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: evtchn_status__bindgen_ty_1__bindgen_ty_2::dom"]
        [::std::mem::offset_of!(evtchn_status__bindgen_ty_1__bindgen_ty_2, dom) - 0usize];
    ["Offset of field: evtchn_status__bindgen_ty_1__bindgen_ty_2::port"]
        [::std::mem::offset_of!(evtchn_status__bindgen_ty_1__bindgen_ty_2, port) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_status__bindgen_ty_1"]
        [::std::mem::size_of::<evtchn_status__bindgen_ty_1>() - 8usize];
    ["Alignment of evtchn_status__bindgen_ty_1"]
        [::std::mem::align_of::<evtchn_status__bindgen_ty_1>() - 4usize];
    ["Offset of field: evtchn_status__bindgen_ty_1::unbound"]
        [::std::mem::offset_of!(evtchn_status__bindgen_ty_1, unbound) - 0usize];
    ["Offset of field: evtchn_status__bindgen_ty_1::interdomain"]
        [::std::mem::offset_of!(evtchn_status__bindgen_ty_1, interdomain) - 0usize];
    ["Offset of field: evtchn_status__bindgen_ty_1::pirq"]
        [::std::mem::offset_of!(evtchn_status__bindgen_ty_1, pirq) - 0usize];
    ["Offset of field: evtchn_status__bindgen_ty_1::virq"]
        [::std::mem::offset_of!(evtchn_status__bindgen_ty_1, virq) - 0usize];
};
impl Default for evtchn_status__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_status"][::std::mem::size_of::<evtchn_status>() - 24usize];
    ["Alignment of evtchn_status"][::std::mem::align_of::<evtchn_status>() - 4usize];
    ["Offset of field: evtchn_status::dom"][::std::mem::offset_of!(evtchn_status, dom) - 0usize];
    ["Offset of field: evtchn_status::port"][::std::mem::offset_of!(evtchn_status, port) - 4usize];
    ["Offset of field: evtchn_status::status"]
        [::std::mem::offset_of!(evtchn_status, status) - 8usize];
    ["Offset of field: evtchn_status::vcpu"][::std::mem::offset_of!(evtchn_status, vcpu) - 12usize];
    ["Offset of field: evtchn_status::u"][::std::mem::offset_of!(evtchn_status, u) - 16usize];
};
impl Default for evtchn_status {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type evtchn_status_t = evtchn_status;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_bind_vcpu {
    pub port: evtchn_port_t,
    pub vcpu: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_bind_vcpu"][::std::mem::size_of::<evtchn_bind_vcpu>() - 8usize];
    ["Alignment of evtchn_bind_vcpu"][::std::mem::align_of::<evtchn_bind_vcpu>() - 4usize];
    ["Offset of field: evtchn_bind_vcpu::port"]
        [::std::mem::offset_of!(evtchn_bind_vcpu, port) - 0usize];
    ["Offset of field: evtchn_bind_vcpu::vcpu"]
        [::std::mem::offset_of!(evtchn_bind_vcpu, vcpu) - 4usize];
};
pub type evtchn_bind_vcpu_t = evtchn_bind_vcpu;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_unmask {
    pub port: evtchn_port_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_unmask"][::std::mem::size_of::<evtchn_unmask>() - 4usize];
    ["Alignment of evtchn_unmask"][::std::mem::align_of::<evtchn_unmask>() - 4usize];
    ["Offset of field: evtchn_unmask::port"][::std::mem::offset_of!(evtchn_unmask, port) - 0usize];
};
pub type evtchn_unmask_t = evtchn_unmask;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_reset {
    pub dom: domid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_reset"][::std::mem::size_of::<evtchn_reset>() - 2usize];
    ["Alignment of evtchn_reset"][::std::mem::align_of::<evtchn_reset>() - 2usize];
    ["Offset of field: evtchn_reset::dom"][::std::mem::offset_of!(evtchn_reset, dom) - 0usize];
};
pub type evtchn_reset_t = evtchn_reset;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_init_control {
    pub control_gfn: u64,
    pub offset: u32,
    pub vcpu: u32,
    pub link_bits: u8,
    pub _pad: [u8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_init_control"][::std::mem::size_of::<evtchn_init_control>() - 24usize];
    ["Alignment of evtchn_init_control"][::std::mem::align_of::<evtchn_init_control>() - 8usize];
    ["Offset of field: evtchn_init_control::control_gfn"]
        [::std::mem::offset_of!(evtchn_init_control, control_gfn) - 0usize];
    ["Offset of field: evtchn_init_control::offset"]
        [::std::mem::offset_of!(evtchn_init_control, offset) - 8usize];
    ["Offset of field: evtchn_init_control::vcpu"]
        [::std::mem::offset_of!(evtchn_init_control, vcpu) - 12usize];
    ["Offset of field: evtchn_init_control::link_bits"]
        [::std::mem::offset_of!(evtchn_init_control, link_bits) - 16usize];
    ["Offset of field: evtchn_init_control::_pad"]
        [::std::mem::offset_of!(evtchn_init_control, _pad) - 17usize];
};
pub type evtchn_init_control_t = evtchn_init_control;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_expand_array {
    pub array_gfn: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_expand_array"][::std::mem::size_of::<evtchn_expand_array>() - 8usize];
    ["Alignment of evtchn_expand_array"][::std::mem::align_of::<evtchn_expand_array>() - 8usize];
    ["Offset of field: evtchn_expand_array::array_gfn"]
        [::std::mem::offset_of!(evtchn_expand_array, array_gfn) - 0usize];
};
pub type evtchn_expand_array_t = evtchn_expand_array;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_set_priority {
    pub port: evtchn_port_t,
    pub priority: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_set_priority"][::std::mem::size_of::<evtchn_set_priority>() - 8usize];
    ["Alignment of evtchn_set_priority"][::std::mem::align_of::<evtchn_set_priority>() - 4usize];
    ["Offset of field: evtchn_set_priority::port"]
        [::std::mem::offset_of!(evtchn_set_priority, port) - 0usize];
    ["Offset of field: evtchn_set_priority::priority"]
        [::std::mem::offset_of!(evtchn_set_priority, priority) - 4usize];
};
pub type evtchn_set_priority_t = evtchn_set_priority;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct evtchn_op {
    pub cmd: u32,
    pub u: evtchn_op__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union evtchn_op__bindgen_ty_1 {
    pub alloc_unbound: evtchn_alloc_unbound_t,
    pub bind_interdomain: evtchn_bind_interdomain_t,
    pub bind_virq: evtchn_bind_virq_t,
    pub bind_pirq: evtchn_bind_pirq_t,
    pub bind_ipi: evtchn_bind_ipi_t,
    pub close: evtchn_close_t,
    pub send: evtchn_send_t,
    pub status: evtchn_status_t,
    pub bind_vcpu: evtchn_bind_vcpu_t,
    pub unmask: evtchn_unmask_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_op__bindgen_ty_1"][::std::mem::size_of::<evtchn_op__bindgen_ty_1>() - 24usize];
    ["Alignment of evtchn_op__bindgen_ty_1"]
        [::std::mem::align_of::<evtchn_op__bindgen_ty_1>() - 4usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::alloc_unbound"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, alloc_unbound) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::bind_interdomain"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, bind_interdomain) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::bind_virq"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, bind_virq) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::bind_pirq"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, bind_pirq) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::bind_ipi"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, bind_ipi) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::close"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, close) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::send"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, send) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::status"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, status) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::bind_vcpu"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, bind_vcpu) - 0usize];
    ["Offset of field: evtchn_op__bindgen_ty_1::unmask"]
        [::std::mem::offset_of!(evtchn_op__bindgen_ty_1, unmask) - 0usize];
};
impl Default for evtchn_op__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_op"][::std::mem::size_of::<evtchn_op>() - 28usize];
    ["Alignment of evtchn_op"][::std::mem::align_of::<evtchn_op>() - 4usize];
    ["Offset of field: evtchn_op::cmd"][::std::mem::offset_of!(evtchn_op, cmd) - 0usize];
    ["Offset of field: evtchn_op::u"][::std::mem::offset_of!(evtchn_op, u) - 4usize];
};
impl Default for evtchn_op {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type evtchn_op_t = evtchn_op;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_evtchn_op_t {
    pub p: *mut evtchn_op_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_evtchn_op_t"]
        [::std::mem::size_of::<__guest_handle_evtchn_op_t>() - 8usize];
    ["Alignment of __guest_handle_evtchn_op_t"]
        [::std::mem::align_of::<__guest_handle_evtchn_op_t>() - 8usize];
    ["Offset of field: __guest_handle_evtchn_op_t::p"]
        [::std::mem::offset_of!(__guest_handle_evtchn_op_t, p) - 0usize];
};
impl Default for __guest_handle_evtchn_op_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_evtchn_op_t {
    pub p: *const evtchn_op_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_evtchn_op_t"]
        [::std::mem::size_of::<__guest_handle_const_evtchn_op_t>() - 8usize];
    ["Alignment of __guest_handle_const_evtchn_op_t"]
        [::std::mem::align_of::<__guest_handle_const_evtchn_op_t>() - 8usize];
    ["Offset of field: __guest_handle_const_evtchn_op_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_evtchn_op_t, p) - 0usize];
};
impl Default for __guest_handle_const_evtchn_op_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type event_word_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct evtchn_fifo_control_block {
    pub ready: u32,
    pub _rsvd: u32,
    pub head: [u32; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of evtchn_fifo_control_block"]
        [::std::mem::size_of::<evtchn_fifo_control_block>() - 72usize];
    ["Alignment of evtchn_fifo_control_block"]
        [::std::mem::align_of::<evtchn_fifo_control_block>() - 4usize];
    ["Offset of field: evtchn_fifo_control_block::ready"]
        [::std::mem::offset_of!(evtchn_fifo_control_block, ready) - 0usize];
    ["Offset of field: evtchn_fifo_control_block::_rsvd"]
        [::std::mem::offset_of!(evtchn_fifo_control_block, _rsvd) - 4usize];
    ["Offset of field: evtchn_fifo_control_block::head"]
        [::std::mem::offset_of!(evtchn_fifo_control_block, head) - 8usize];
};
pub type evtchn_fifo_control_block_t = evtchn_fifo_control_block;
pub type grant_ref_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct grant_entry_v1 {
    pub flags: u16,
    pub domid: domid_t,
    pub frame: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of grant_entry_v1"][::std::mem::size_of::<grant_entry_v1>() - 8usize];
    ["Alignment of grant_entry_v1"][::std::mem::align_of::<grant_entry_v1>() - 4usize];
    ["Offset of field: grant_entry_v1::flags"]
        [::std::mem::offset_of!(grant_entry_v1, flags) - 0usize];
    ["Offset of field: grant_entry_v1::domid"]
        [::std::mem::offset_of!(grant_entry_v1, domid) - 2usize];
    ["Offset of field: grant_entry_v1::frame"]
        [::std::mem::offset_of!(grant_entry_v1, frame) - 4usize];
};
pub type grant_entry_v1_t = grant_entry_v1;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct grant_entry_header {
    pub flags: u16,
    pub domid: domid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of grant_entry_header"][::std::mem::size_of::<grant_entry_header>() - 4usize];
    ["Alignment of grant_entry_header"][::std::mem::align_of::<grant_entry_header>() - 2usize];
    ["Offset of field: grant_entry_header::flags"]
        [::std::mem::offset_of!(grant_entry_header, flags) - 0usize];
    ["Offset of field: grant_entry_header::domid"]
        [::std::mem::offset_of!(grant_entry_header, domid) - 2usize];
};
pub type grant_entry_header_t = grant_entry_header;
#[repr(C)]
#[derive(Copy, Clone)]
pub union grant_entry_v2 {
    pub hdr: grant_entry_header_t,
    pub full_page: grant_entry_v2__bindgen_ty_1,
    pub sub_page: grant_entry_v2__bindgen_ty_2,
    pub transitive: grant_entry_v2__bindgen_ty_3,
    pub __spacer: [u32; 4usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_1 {
    pub hdr: grant_entry_header_t,
    pub pad0: u32,
    pub frame: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of grant_entry_v2__bindgen_ty_1"]
        [::std::mem::size_of::<grant_entry_v2__bindgen_ty_1>() - 16usize];
    ["Alignment of grant_entry_v2__bindgen_ty_1"]
        [::std::mem::align_of::<grant_entry_v2__bindgen_ty_1>() - 8usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_1, hdr) - 0usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_1::pad0"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_1, pad0) - 4usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_1::frame"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_1, frame) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_2 {
    pub hdr: grant_entry_header_t,
    pub page_off: u16,
    pub length: u16,
    pub frame: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of grant_entry_v2__bindgen_ty_2"]
        [::std::mem::size_of::<grant_entry_v2__bindgen_ty_2>() - 16usize];
    ["Alignment of grant_entry_v2__bindgen_ty_2"]
        [::std::mem::align_of::<grant_entry_v2__bindgen_ty_2>() - 8usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_2::hdr"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_2, hdr) - 0usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_2::page_off"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_2, page_off) - 4usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_2::length"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_2, length) - 6usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_2::frame"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_2, frame) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_3 {
    pub hdr: grant_entry_header_t,
    pub trans_domid: domid_t,
    pub pad0: u16,
    pub gref: grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of grant_entry_v2__bindgen_ty_3"]
        [::std::mem::size_of::<grant_entry_v2__bindgen_ty_3>() - 12usize];
    ["Alignment of grant_entry_v2__bindgen_ty_3"]
        [::std::mem::align_of::<grant_entry_v2__bindgen_ty_3>() - 4usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_3::hdr"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_3, hdr) - 0usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_3::trans_domid"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_3, trans_domid) - 4usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_3::pad0"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_3, pad0) - 6usize];
    ["Offset of field: grant_entry_v2__bindgen_ty_3::gref"]
        [::std::mem::offset_of!(grant_entry_v2__bindgen_ty_3, gref) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of grant_entry_v2"][::std::mem::size_of::<grant_entry_v2>() - 16usize];
    ["Alignment of grant_entry_v2"][::std::mem::align_of::<grant_entry_v2>() - 8usize];
    ["Offset of field: grant_entry_v2::hdr"][::std::mem::offset_of!(grant_entry_v2, hdr) - 0usize];
    ["Offset of field: grant_entry_v2::full_page"]
        [::std::mem::offset_of!(grant_entry_v2, full_page) - 0usize];
    ["Offset of field: grant_entry_v2::sub_page"]
        [::std::mem::offset_of!(grant_entry_v2, sub_page) - 0usize];
    ["Offset of field: grant_entry_v2::transitive"]
        [::std::mem::offset_of!(grant_entry_v2, transitive) - 0usize];
    ["Offset of field: grant_entry_v2::__spacer"]
        [::std::mem::offset_of!(grant_entry_v2, __spacer) - 0usize];
};
impl Default for grant_entry_v2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type grant_entry_v2_t = grant_entry_v2;
pub type grant_status_t = u16;
pub type grant_handle_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_map_grant_ref {
    pub host_addr: u64,
    pub flags: u32,
    pub ref_: grant_ref_t,
    pub dom: domid_t,
    pub status: i16,
    pub handle: grant_handle_t,
    pub dev_bus_addr: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_map_grant_ref"][::std::mem::size_of::<gnttab_map_grant_ref>() - 32usize];
    ["Alignment of gnttab_map_grant_ref"][::std::mem::align_of::<gnttab_map_grant_ref>() - 8usize];
    ["Offset of field: gnttab_map_grant_ref::host_addr"]
        [::std::mem::offset_of!(gnttab_map_grant_ref, host_addr) - 0usize];
    ["Offset of field: gnttab_map_grant_ref::flags"]
        [::std::mem::offset_of!(gnttab_map_grant_ref, flags) - 8usize];
    ["Offset of field: gnttab_map_grant_ref::ref_"]
        [::std::mem::offset_of!(gnttab_map_grant_ref, ref_) - 12usize];
    ["Offset of field: gnttab_map_grant_ref::dom"]
        [::std::mem::offset_of!(gnttab_map_grant_ref, dom) - 16usize];
    ["Offset of field: gnttab_map_grant_ref::status"]
        [::std::mem::offset_of!(gnttab_map_grant_ref, status) - 18usize];
    ["Offset of field: gnttab_map_grant_ref::handle"]
        [::std::mem::offset_of!(gnttab_map_grant_ref, handle) - 20usize];
    ["Offset of field: gnttab_map_grant_ref::dev_bus_addr"]
        [::std::mem::offset_of!(gnttab_map_grant_ref, dev_bus_addr) - 24usize];
};
pub type gnttab_map_grant_ref_t = gnttab_map_grant_ref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_map_grant_ref_t {
    pub p: *mut gnttab_map_grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_map_grant_ref_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_map_grant_ref_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_map_grant_ref_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_map_grant_ref_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_map_grant_ref_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_map_grant_ref_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_map_grant_ref_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_map_grant_ref_t {
    pub p: *const gnttab_map_grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_map_grant_ref_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_map_grant_ref_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_map_grant_ref_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_map_grant_ref_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_map_grant_ref_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_map_grant_ref_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_map_grant_ref_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_unmap_grant_ref {
    pub host_addr: u64,
    pub dev_bus_addr: u64,
    pub handle: grant_handle_t,
    pub status: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_unmap_grant_ref"][::std::mem::size_of::<gnttab_unmap_grant_ref>() - 24usize];
    ["Alignment of gnttab_unmap_grant_ref"]
        [::std::mem::align_of::<gnttab_unmap_grant_ref>() - 8usize];
    ["Offset of field: gnttab_unmap_grant_ref::host_addr"]
        [::std::mem::offset_of!(gnttab_unmap_grant_ref, host_addr) - 0usize];
    ["Offset of field: gnttab_unmap_grant_ref::dev_bus_addr"]
        [::std::mem::offset_of!(gnttab_unmap_grant_ref, dev_bus_addr) - 8usize];
    ["Offset of field: gnttab_unmap_grant_ref::handle"]
        [::std::mem::offset_of!(gnttab_unmap_grant_ref, handle) - 16usize];
    ["Offset of field: gnttab_unmap_grant_ref::status"]
        [::std::mem::offset_of!(gnttab_unmap_grant_ref, status) - 20usize];
};
pub type gnttab_unmap_grant_ref_t = gnttab_unmap_grant_ref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_unmap_grant_ref_t {
    pub p: *mut gnttab_unmap_grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_unmap_grant_ref_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_unmap_grant_ref_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_unmap_grant_ref_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_unmap_grant_ref_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_unmap_grant_ref_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_unmap_grant_ref_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_unmap_grant_ref_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_unmap_grant_ref_t {
    pub p: *const gnttab_unmap_grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_unmap_grant_ref_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_unmap_grant_ref_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_unmap_grant_ref_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_unmap_grant_ref_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_unmap_grant_ref_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_unmap_grant_ref_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_unmap_grant_ref_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_setup_table {
    pub dom: domid_t,
    pub nr_frames: u32,
    pub status: i16,
    pub frame_list: __guest_handle_xen_pfn_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_setup_table"][::std::mem::size_of::<gnttab_setup_table>() - 24usize];
    ["Alignment of gnttab_setup_table"][::std::mem::align_of::<gnttab_setup_table>() - 8usize];
    ["Offset of field: gnttab_setup_table::dom"]
        [::std::mem::offset_of!(gnttab_setup_table, dom) - 0usize];
    ["Offset of field: gnttab_setup_table::nr_frames"]
        [::std::mem::offset_of!(gnttab_setup_table, nr_frames) - 4usize];
    ["Offset of field: gnttab_setup_table::status"]
        [::std::mem::offset_of!(gnttab_setup_table, status) - 8usize];
    ["Offset of field: gnttab_setup_table::frame_list"]
        [::std::mem::offset_of!(gnttab_setup_table, frame_list) - 16usize];
};
impl Default for gnttab_setup_table {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type gnttab_setup_table_t = gnttab_setup_table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_setup_table_t {
    pub p: *mut gnttab_setup_table_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_setup_table_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_setup_table_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_setup_table_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_setup_table_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_setup_table_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_setup_table_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_setup_table_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_setup_table_t {
    pub p: *const gnttab_setup_table_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_setup_table_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_setup_table_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_setup_table_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_setup_table_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_setup_table_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_setup_table_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_setup_table_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_dump_table {
    pub dom: domid_t,
    pub status: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_dump_table"][::std::mem::size_of::<gnttab_dump_table>() - 4usize];
    ["Alignment of gnttab_dump_table"][::std::mem::align_of::<gnttab_dump_table>() - 2usize];
    ["Offset of field: gnttab_dump_table::dom"]
        [::std::mem::offset_of!(gnttab_dump_table, dom) - 0usize];
    ["Offset of field: gnttab_dump_table::status"]
        [::std::mem::offset_of!(gnttab_dump_table, status) - 2usize];
};
pub type gnttab_dump_table_t = gnttab_dump_table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_dump_table_t {
    pub p: *mut gnttab_dump_table_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_dump_table_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_dump_table_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_dump_table_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_dump_table_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_dump_table_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_dump_table_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_dump_table_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_dump_table_t {
    pub p: *const gnttab_dump_table_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_dump_table_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_dump_table_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_dump_table_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_dump_table_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_dump_table_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_dump_table_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_dump_table_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_transfer {
    pub mfn: xen_pfn_t,
    pub domid: domid_t,
    pub ref_: grant_ref_t,
    pub status: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_transfer"][::std::mem::size_of::<gnttab_transfer>() - 24usize];
    ["Alignment of gnttab_transfer"][::std::mem::align_of::<gnttab_transfer>() - 8usize];
    ["Offset of field: gnttab_transfer::mfn"]
        [::std::mem::offset_of!(gnttab_transfer, mfn) - 0usize];
    ["Offset of field: gnttab_transfer::domid"]
        [::std::mem::offset_of!(gnttab_transfer, domid) - 8usize];
    ["Offset of field: gnttab_transfer::ref_"]
        [::std::mem::offset_of!(gnttab_transfer, ref_) - 12usize];
    ["Offset of field: gnttab_transfer::status"]
        [::std::mem::offset_of!(gnttab_transfer, status) - 16usize];
};
pub type gnttab_transfer_t = gnttab_transfer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_transfer_t {
    pub p: *mut gnttab_transfer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_transfer_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_transfer_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_transfer_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_transfer_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_transfer_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_transfer_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_transfer_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_transfer_t {
    pub p: *const gnttab_transfer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_transfer_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_transfer_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_transfer_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_transfer_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_transfer_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_transfer_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_transfer_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gnttab_copy {
    pub source: gnttab_copy_gnttab_copy_ptr,
    pub dest: gnttab_copy_gnttab_copy_ptr,
    pub len: u16,
    pub flags: u16,
    pub status: i16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gnttab_copy_gnttab_copy_ptr {
    pub u: gnttab_copy_gnttab_copy_ptr__bindgen_ty_1,
    pub domid: domid_t,
    pub offset: u16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union gnttab_copy_gnttab_copy_ptr__bindgen_ty_1 {
    pub ref_: grant_ref_t,
    pub gmfn: xen_pfn_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_copy_gnttab_copy_ptr__bindgen_ty_1"]
        [::std::mem::size_of::<gnttab_copy_gnttab_copy_ptr__bindgen_ty_1>() - 8usize];
    ["Alignment of gnttab_copy_gnttab_copy_ptr__bindgen_ty_1"]
        [::std::mem::align_of::<gnttab_copy_gnttab_copy_ptr__bindgen_ty_1>() - 8usize];
    ["Offset of field: gnttab_copy_gnttab_copy_ptr__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(gnttab_copy_gnttab_copy_ptr__bindgen_ty_1, ref_) - 0usize];
    ["Offset of field: gnttab_copy_gnttab_copy_ptr__bindgen_ty_1::gmfn"]
        [::std::mem::offset_of!(gnttab_copy_gnttab_copy_ptr__bindgen_ty_1, gmfn) - 0usize];
};
impl Default for gnttab_copy_gnttab_copy_ptr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_copy_gnttab_copy_ptr"]
        [::std::mem::size_of::<gnttab_copy_gnttab_copy_ptr>() - 16usize];
    ["Alignment of gnttab_copy_gnttab_copy_ptr"]
        [::std::mem::align_of::<gnttab_copy_gnttab_copy_ptr>() - 8usize];
    ["Offset of field: gnttab_copy_gnttab_copy_ptr::u"]
        [::std::mem::offset_of!(gnttab_copy_gnttab_copy_ptr, u) - 0usize];
    ["Offset of field: gnttab_copy_gnttab_copy_ptr::domid"]
        [::std::mem::offset_of!(gnttab_copy_gnttab_copy_ptr, domid) - 8usize];
    ["Offset of field: gnttab_copy_gnttab_copy_ptr::offset"]
        [::std::mem::offset_of!(gnttab_copy_gnttab_copy_ptr, offset) - 10usize];
};
impl Default for gnttab_copy_gnttab_copy_ptr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_copy"][::std::mem::size_of::<gnttab_copy>() - 40usize];
    ["Alignment of gnttab_copy"][::std::mem::align_of::<gnttab_copy>() - 8usize];
    ["Offset of field: gnttab_copy::source"][::std::mem::offset_of!(gnttab_copy, source) - 0usize];
    ["Offset of field: gnttab_copy::dest"][::std::mem::offset_of!(gnttab_copy, dest) - 16usize];
    ["Offset of field: gnttab_copy::len"][::std::mem::offset_of!(gnttab_copy, len) - 32usize];
    ["Offset of field: gnttab_copy::flags"][::std::mem::offset_of!(gnttab_copy, flags) - 34usize];
    ["Offset of field: gnttab_copy::status"][::std::mem::offset_of!(gnttab_copy, status) - 36usize];
};
impl Default for gnttab_copy {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type gnttab_copy_t = gnttab_copy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_copy_t {
    pub p: *mut gnttab_copy_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_copy_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_copy_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_copy_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_copy_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_copy_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_copy_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_copy_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_copy_t {
    pub p: *const gnttab_copy_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_copy_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_copy_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_copy_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_copy_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_copy_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_copy_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_copy_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_query_size {
    pub dom: domid_t,
    pub nr_frames: u32,
    pub max_nr_frames: u32,
    pub status: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_query_size"][::std::mem::size_of::<gnttab_query_size>() - 16usize];
    ["Alignment of gnttab_query_size"][::std::mem::align_of::<gnttab_query_size>() - 4usize];
    ["Offset of field: gnttab_query_size::dom"]
        [::std::mem::offset_of!(gnttab_query_size, dom) - 0usize];
    ["Offset of field: gnttab_query_size::nr_frames"]
        [::std::mem::offset_of!(gnttab_query_size, nr_frames) - 4usize];
    ["Offset of field: gnttab_query_size::max_nr_frames"]
        [::std::mem::offset_of!(gnttab_query_size, max_nr_frames) - 8usize];
    ["Offset of field: gnttab_query_size::status"]
        [::std::mem::offset_of!(gnttab_query_size, status) - 12usize];
};
pub type gnttab_query_size_t = gnttab_query_size;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_query_size_t {
    pub p: *mut gnttab_query_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_query_size_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_query_size_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_query_size_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_query_size_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_query_size_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_query_size_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_query_size_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_query_size_t {
    pub p: *const gnttab_query_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_query_size_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_query_size_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_query_size_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_query_size_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_query_size_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_query_size_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_query_size_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_unmap_and_replace {
    pub host_addr: u64,
    pub new_addr: u64,
    pub handle: grant_handle_t,
    pub status: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_unmap_and_replace"]
        [::std::mem::size_of::<gnttab_unmap_and_replace>() - 24usize];
    ["Alignment of gnttab_unmap_and_replace"]
        [::std::mem::align_of::<gnttab_unmap_and_replace>() - 8usize];
    ["Offset of field: gnttab_unmap_and_replace::host_addr"]
        [::std::mem::offset_of!(gnttab_unmap_and_replace, host_addr) - 0usize];
    ["Offset of field: gnttab_unmap_and_replace::new_addr"]
        [::std::mem::offset_of!(gnttab_unmap_and_replace, new_addr) - 8usize];
    ["Offset of field: gnttab_unmap_and_replace::handle"]
        [::std::mem::offset_of!(gnttab_unmap_and_replace, handle) - 16usize];
    ["Offset of field: gnttab_unmap_and_replace::status"]
        [::std::mem::offset_of!(gnttab_unmap_and_replace, status) - 20usize];
};
pub type gnttab_unmap_and_replace_t = gnttab_unmap_and_replace;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_unmap_and_replace_t {
    pub p: *mut gnttab_unmap_and_replace_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_unmap_and_replace_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_unmap_and_replace_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_unmap_and_replace_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_unmap_and_replace_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_unmap_and_replace_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_unmap_and_replace_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_unmap_and_replace_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_unmap_and_replace_t {
    pub p: *const gnttab_unmap_and_replace_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_unmap_and_replace_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_unmap_and_replace_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_unmap_and_replace_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_unmap_and_replace_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_unmap_and_replace_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_unmap_and_replace_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_unmap_and_replace_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_set_version {
    pub version: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_set_version"][::std::mem::size_of::<gnttab_set_version>() - 4usize];
    ["Alignment of gnttab_set_version"][::std::mem::align_of::<gnttab_set_version>() - 4usize];
    ["Offset of field: gnttab_set_version::version"]
        [::std::mem::offset_of!(gnttab_set_version, version) - 0usize];
};
pub type gnttab_set_version_t = gnttab_set_version;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_set_version_t {
    pub p: *mut gnttab_set_version_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_set_version_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_set_version_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_set_version_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_set_version_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_set_version_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_set_version_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_set_version_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_set_version_t {
    pub p: *const gnttab_set_version_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_set_version_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_set_version_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_set_version_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_set_version_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_set_version_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_set_version_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_set_version_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_get_status_frames {
    pub nr_frames: u32,
    pub dom: domid_t,
    pub status: i16,
    pub frame_list: __guest_handle_uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_get_status_frames"]
        [::std::mem::size_of::<gnttab_get_status_frames>() - 16usize];
    ["Alignment of gnttab_get_status_frames"]
        [::std::mem::align_of::<gnttab_get_status_frames>() - 8usize];
    ["Offset of field: gnttab_get_status_frames::nr_frames"]
        [::std::mem::offset_of!(gnttab_get_status_frames, nr_frames) - 0usize];
    ["Offset of field: gnttab_get_status_frames::dom"]
        [::std::mem::offset_of!(gnttab_get_status_frames, dom) - 4usize];
    ["Offset of field: gnttab_get_status_frames::status"]
        [::std::mem::offset_of!(gnttab_get_status_frames, status) - 6usize];
    ["Offset of field: gnttab_get_status_frames::frame_list"]
        [::std::mem::offset_of!(gnttab_get_status_frames, frame_list) - 8usize];
};
impl Default for gnttab_get_status_frames {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type gnttab_get_status_frames_t = gnttab_get_status_frames;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_get_status_frames_t {
    pub p: *mut gnttab_get_status_frames_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_get_status_frames_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_get_status_frames_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_get_status_frames_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_get_status_frames_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_get_status_frames_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_get_status_frames_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_get_status_frames_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_get_status_frames_t {
    pub p: *const gnttab_get_status_frames_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_get_status_frames_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_get_status_frames_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_get_status_frames_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_get_status_frames_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_get_status_frames_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_get_status_frames_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_get_status_frames_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_get_version {
    pub dom: domid_t,
    pub pad: u16,
    pub version: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_get_version"][::std::mem::size_of::<gnttab_get_version>() - 8usize];
    ["Alignment of gnttab_get_version"][::std::mem::align_of::<gnttab_get_version>() - 4usize];
    ["Offset of field: gnttab_get_version::dom"]
        [::std::mem::offset_of!(gnttab_get_version, dom) - 0usize];
    ["Offset of field: gnttab_get_version::pad"]
        [::std::mem::offset_of!(gnttab_get_version, pad) - 2usize];
    ["Offset of field: gnttab_get_version::version"]
        [::std::mem::offset_of!(gnttab_get_version, version) - 4usize];
};
pub type gnttab_get_version_t = gnttab_get_version;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_get_version_t {
    pub p: *mut gnttab_get_version_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_get_version_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_get_version_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_get_version_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_get_version_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_get_version_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_get_version_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_get_version_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_get_version_t {
    pub p: *const gnttab_get_version_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_get_version_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_get_version_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_get_version_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_get_version_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_get_version_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_get_version_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_get_version_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct gnttab_swap_grant_ref {
    pub ref_a: grant_ref_t,
    pub ref_b: grant_ref_t,
    pub status: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_swap_grant_ref"][::std::mem::size_of::<gnttab_swap_grant_ref>() - 12usize];
    ["Alignment of gnttab_swap_grant_ref"]
        [::std::mem::align_of::<gnttab_swap_grant_ref>() - 4usize];
    ["Offset of field: gnttab_swap_grant_ref::ref_a"]
        [::std::mem::offset_of!(gnttab_swap_grant_ref, ref_a) - 0usize];
    ["Offset of field: gnttab_swap_grant_ref::ref_b"]
        [::std::mem::offset_of!(gnttab_swap_grant_ref, ref_b) - 4usize];
    ["Offset of field: gnttab_swap_grant_ref::status"]
        [::std::mem::offset_of!(gnttab_swap_grant_ref, status) - 8usize];
};
pub type gnttab_swap_grant_ref_t = gnttab_swap_grant_ref;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_swap_grant_ref_t {
    pub p: *mut gnttab_swap_grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_swap_grant_ref_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_swap_grant_ref_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_swap_grant_ref_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_swap_grant_ref_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_swap_grant_ref_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_swap_grant_ref_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_swap_grant_ref_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_swap_grant_ref_t {
    pub p: *const gnttab_swap_grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_swap_grant_ref_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_swap_grant_ref_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_swap_grant_ref_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_swap_grant_ref_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_swap_grant_ref_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_swap_grant_ref_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_swap_grant_ref_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gnttab_cache_flush {
    pub a: gnttab_cache_flush__bindgen_ty_1,
    pub offset: u16,
    pub length: u16,
    pub op: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union gnttab_cache_flush__bindgen_ty_1 {
    pub dev_bus_addr: u64,
    pub ref_: grant_ref_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_cache_flush__bindgen_ty_1"]
        [::std::mem::size_of::<gnttab_cache_flush__bindgen_ty_1>() - 8usize];
    ["Alignment of gnttab_cache_flush__bindgen_ty_1"]
        [::std::mem::align_of::<gnttab_cache_flush__bindgen_ty_1>() - 8usize];
    ["Offset of field: gnttab_cache_flush__bindgen_ty_1::dev_bus_addr"]
        [::std::mem::offset_of!(gnttab_cache_flush__bindgen_ty_1, dev_bus_addr) - 0usize];
    ["Offset of field: gnttab_cache_flush__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(gnttab_cache_flush__bindgen_ty_1, ref_) - 0usize];
};
impl Default for gnttab_cache_flush__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gnttab_cache_flush"][::std::mem::size_of::<gnttab_cache_flush>() - 16usize];
    ["Alignment of gnttab_cache_flush"][::std::mem::align_of::<gnttab_cache_flush>() - 8usize];
    ["Offset of field: gnttab_cache_flush::a"]
        [::std::mem::offset_of!(gnttab_cache_flush, a) - 0usize];
    ["Offset of field: gnttab_cache_flush::offset"]
        [::std::mem::offset_of!(gnttab_cache_flush, offset) - 8usize];
    ["Offset of field: gnttab_cache_flush::length"]
        [::std::mem::offset_of!(gnttab_cache_flush, length) - 10usize];
    ["Offset of field: gnttab_cache_flush::op"]
        [::std::mem::offset_of!(gnttab_cache_flush, op) - 12usize];
};
impl Default for gnttab_cache_flush {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type gnttab_cache_flush_t = gnttab_cache_flush;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_gnttab_cache_flush_t {
    pub p: *mut gnttab_cache_flush_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_gnttab_cache_flush_t"]
        [::std::mem::size_of::<__guest_handle_gnttab_cache_flush_t>() - 8usize];
    ["Alignment of __guest_handle_gnttab_cache_flush_t"]
        [::std::mem::align_of::<__guest_handle_gnttab_cache_flush_t>() - 8usize];
    ["Offset of field: __guest_handle_gnttab_cache_flush_t::p"]
        [::std::mem::offset_of!(__guest_handle_gnttab_cache_flush_t, p) - 0usize];
};
impl Default for __guest_handle_gnttab_cache_flush_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __guest_handle_const_gnttab_cache_flush_t {
    pub p: *const gnttab_cache_flush_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __guest_handle_const_gnttab_cache_flush_t"]
        [::std::mem::size_of::<__guest_handle_const_gnttab_cache_flush_t>() - 8usize];
    ["Alignment of __guest_handle_const_gnttab_cache_flush_t"]
        [::std::mem::align_of::<__guest_handle_const_gnttab_cache_flush_t>() - 8usize];
    ["Offset of field: __guest_handle_const_gnttab_cache_flush_t::p"]
        [::std::mem::offset_of!(__guest_handle_const_gnttab_cache_flush_t, p) - 0usize];
};
impl Default for __guest_handle_const_gnttab_cache_flush_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_save_descriptor {
    pub typecode: u16,
    pub instance: u16,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_save_descriptor"][::std::mem::size_of::<hvm_save_descriptor>() - 8usize];
    ["Alignment of hvm_save_descriptor"][::std::mem::align_of::<hvm_save_descriptor>() - 4usize];
    ["Offset of field: hvm_save_descriptor::typecode"]
        [::std::mem::offset_of!(hvm_save_descriptor, typecode) - 0usize];
    ["Offset of field: hvm_save_descriptor::instance"]
        [::std::mem::offset_of!(hvm_save_descriptor, instance) - 2usize];
    ["Offset of field: hvm_save_descriptor::length"]
        [::std::mem::offset_of!(hvm_save_descriptor, length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_save_end {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_save_end"][::std::mem::size_of::<hvm_save_end>() - 0usize];
    ["Alignment of hvm_save_end"][::std::mem::align_of::<hvm_save_end>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct __HVM_SAVE_TYPE_END {
    pub t: hvm_save_end,
    pub c: __IncompleteArrayField<::std::os::raw::c_char>,
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_END"][::std::mem::size_of::<__HVM_SAVE_TYPE_END>() - 1usize];
    ["Alignment of __HVM_SAVE_TYPE_END"][::std::mem::align_of::<__HVM_SAVE_TYPE_END>() - 1usize];
    ["Offset of field: __HVM_SAVE_TYPE_END::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_END, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_END::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_END, c) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_END::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_END, cpt) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_save_header {
    pub magic: u32,
    pub version: u32,
    pub changeset: u64,
    pub cpuid: u32,
    pub gtsc_khz: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_save_header"][::std::mem::size_of::<hvm_save_header>() - 24usize];
    ["Alignment of hvm_save_header"][::std::mem::align_of::<hvm_save_header>() - 8usize];
    ["Offset of field: hvm_save_header::magic"]
        [::std::mem::offset_of!(hvm_save_header, magic) - 0usize];
    ["Offset of field: hvm_save_header::version"]
        [::std::mem::offset_of!(hvm_save_header, version) - 4usize];
    ["Offset of field: hvm_save_header::changeset"]
        [::std::mem::offset_of!(hvm_save_header, changeset) - 8usize];
    ["Offset of field: hvm_save_header::cpuid"]
        [::std::mem::offset_of!(hvm_save_header, cpuid) - 16usize];
    ["Offset of field: hvm_save_header::gtsc_khz"]
        [::std::mem::offset_of!(hvm_save_header, gtsc_khz) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_HEADER {
    pub t: hvm_save_header,
    pub c: [::std::os::raw::c_char; 1usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_HEADER"][::std::mem::size_of::<__HVM_SAVE_TYPE_HEADER>() - 32usize];
    ["Alignment of __HVM_SAVE_TYPE_HEADER"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_HEADER>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_HEADER::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_HEADER, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_HEADER::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_HEADER, c) - 24usize];
    ["Offset of field: __HVM_SAVE_TYPE_HEADER::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_HEADER, cpt) - 25usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hvm_hw_cpu {
    pub fpu_regs: [u8; 512usize],
    pub rax: u64,
    pub rbx: u64,
    pub rcx: u64,
    pub rdx: u64,
    pub rbp: u64,
    pub rsi: u64,
    pub rdi: u64,
    pub rsp: u64,
    pub r8: u64,
    pub r9: u64,
    pub r10: u64,
    pub r11: u64,
    pub r12: u64,
    pub r13: u64,
    pub r14: u64,
    pub r15: u64,
    pub rip: u64,
    pub rflags: u64,
    pub cr0: u64,
    pub cr2: u64,
    pub cr3: u64,
    pub cr4: u64,
    pub dr0: u64,
    pub dr1: u64,
    pub dr2: u64,
    pub dr3: u64,
    pub dr6: u64,
    pub dr7: u64,
    pub cs_sel: u32,
    pub ds_sel: u32,
    pub es_sel: u32,
    pub fs_sel: u32,
    pub gs_sel: u32,
    pub ss_sel: u32,
    pub tr_sel: u32,
    pub ldtr_sel: u32,
    pub cs_limit: u32,
    pub ds_limit: u32,
    pub es_limit: u32,
    pub fs_limit: u32,
    pub gs_limit: u32,
    pub ss_limit: u32,
    pub tr_limit: u32,
    pub ldtr_limit: u32,
    pub idtr_limit: u32,
    pub gdtr_limit: u32,
    pub cs_base: u64,
    pub ds_base: u64,
    pub es_base: u64,
    pub fs_base: u64,
    pub gs_base: u64,
    pub ss_base: u64,
    pub tr_base: u64,
    pub ldtr_base: u64,
    pub idtr_base: u64,
    pub gdtr_base: u64,
    pub cs_arbytes: u32,
    pub ds_arbytes: u32,
    pub es_arbytes: u32,
    pub fs_arbytes: u32,
    pub gs_arbytes: u32,
    pub ss_arbytes: u32,
    pub tr_arbytes: u32,
    pub ldtr_arbytes: u32,
    pub sysenter_cs: u64,
    pub sysenter_esp: u64,
    pub sysenter_eip: u64,
    pub shadow_gs: u64,
    pub msr_flags: u64,
    pub msr_lstar: u64,
    pub msr_star: u64,
    pub msr_cstar: u64,
    pub msr_syscall_mask: u64,
    pub msr_efer: u64,
    pub msr_tsc_aux: u64,
    pub tsc: u64,
    pub __bindgen_anon_1: hvm_hw_cpu__bindgen_ty_1,
    pub error_code: u32,
    pub flags: u32,
    pub pad0: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hvm_hw_cpu__bindgen_ty_1 {
    pub pending_event: u32,
    pub __bindgen_anon_1: hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1>() - 4usize];
};
impl hvm_hw_cpu__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn pending_vector(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_pending_vector(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_type(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_pending_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_error_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_error_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 19u8) as u32) }
    }
    #[inline]
    pub fn set_pending_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 19u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pending_vector: u8,
        pending_type: u8,
        pending_error_valid: u8,
        pending_reserved: u32,
        pending_valid: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let pending_vector: u8 = unsafe { ::std::mem::transmute(pending_vector) };
            pending_vector as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let pending_type: u8 = unsafe { ::std::mem::transmute(pending_type) };
            pending_type as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let pending_error_valid: u8 = unsafe { ::std::mem::transmute(pending_error_valid) };
            pending_error_valid as u64
        });
        __bindgen_bitfield_unit.set(12usize, 19u8, {
            let pending_reserved: u32 = unsafe { ::std::mem::transmute(pending_reserved) };
            pending_reserved as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let pending_valid: u8 = unsafe { ::std::mem::transmute(pending_valid) };
            pending_valid as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_cpu__bindgen_ty_1"]
        [::std::mem::size_of::<hvm_hw_cpu__bindgen_ty_1>() - 4usize];
    ["Alignment of hvm_hw_cpu__bindgen_ty_1"]
        [::std::mem::align_of::<hvm_hw_cpu__bindgen_ty_1>() - 4usize];
    ["Offset of field: hvm_hw_cpu__bindgen_ty_1::pending_event"]
        [::std::mem::offset_of!(hvm_hw_cpu__bindgen_ty_1, pending_event) - 0usize];
};
impl Default for hvm_hw_cpu__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_cpu"][::std::mem::size_of::<hvm_hw_cpu>() - 1032usize];
    ["Alignment of hvm_hw_cpu"][::std::mem::align_of::<hvm_hw_cpu>() - 8usize];
    ["Offset of field: hvm_hw_cpu::fpu_regs"]
        [::std::mem::offset_of!(hvm_hw_cpu, fpu_regs) - 0usize];
    ["Offset of field: hvm_hw_cpu::rax"][::std::mem::offset_of!(hvm_hw_cpu, rax) - 512usize];
    ["Offset of field: hvm_hw_cpu::rbx"][::std::mem::offset_of!(hvm_hw_cpu, rbx) - 520usize];
    ["Offset of field: hvm_hw_cpu::rcx"][::std::mem::offset_of!(hvm_hw_cpu, rcx) - 528usize];
    ["Offset of field: hvm_hw_cpu::rdx"][::std::mem::offset_of!(hvm_hw_cpu, rdx) - 536usize];
    ["Offset of field: hvm_hw_cpu::rbp"][::std::mem::offset_of!(hvm_hw_cpu, rbp) - 544usize];
    ["Offset of field: hvm_hw_cpu::rsi"][::std::mem::offset_of!(hvm_hw_cpu, rsi) - 552usize];
    ["Offset of field: hvm_hw_cpu::rdi"][::std::mem::offset_of!(hvm_hw_cpu, rdi) - 560usize];
    ["Offset of field: hvm_hw_cpu::rsp"][::std::mem::offset_of!(hvm_hw_cpu, rsp) - 568usize];
    ["Offset of field: hvm_hw_cpu::r8"][::std::mem::offset_of!(hvm_hw_cpu, r8) - 576usize];
    ["Offset of field: hvm_hw_cpu::r9"][::std::mem::offset_of!(hvm_hw_cpu, r9) - 584usize];
    ["Offset of field: hvm_hw_cpu::r10"][::std::mem::offset_of!(hvm_hw_cpu, r10) - 592usize];
    ["Offset of field: hvm_hw_cpu::r11"][::std::mem::offset_of!(hvm_hw_cpu, r11) - 600usize];
    ["Offset of field: hvm_hw_cpu::r12"][::std::mem::offset_of!(hvm_hw_cpu, r12) - 608usize];
    ["Offset of field: hvm_hw_cpu::r13"][::std::mem::offset_of!(hvm_hw_cpu, r13) - 616usize];
    ["Offset of field: hvm_hw_cpu::r14"][::std::mem::offset_of!(hvm_hw_cpu, r14) - 624usize];
    ["Offset of field: hvm_hw_cpu::r15"][::std::mem::offset_of!(hvm_hw_cpu, r15) - 632usize];
    ["Offset of field: hvm_hw_cpu::rip"][::std::mem::offset_of!(hvm_hw_cpu, rip) - 640usize];
    ["Offset of field: hvm_hw_cpu::rflags"][::std::mem::offset_of!(hvm_hw_cpu, rflags) - 648usize];
    ["Offset of field: hvm_hw_cpu::cr0"][::std::mem::offset_of!(hvm_hw_cpu, cr0) - 656usize];
    ["Offset of field: hvm_hw_cpu::cr2"][::std::mem::offset_of!(hvm_hw_cpu, cr2) - 664usize];
    ["Offset of field: hvm_hw_cpu::cr3"][::std::mem::offset_of!(hvm_hw_cpu, cr3) - 672usize];
    ["Offset of field: hvm_hw_cpu::cr4"][::std::mem::offset_of!(hvm_hw_cpu, cr4) - 680usize];
    ["Offset of field: hvm_hw_cpu::dr0"][::std::mem::offset_of!(hvm_hw_cpu, dr0) - 688usize];
    ["Offset of field: hvm_hw_cpu::dr1"][::std::mem::offset_of!(hvm_hw_cpu, dr1) - 696usize];
    ["Offset of field: hvm_hw_cpu::dr2"][::std::mem::offset_of!(hvm_hw_cpu, dr2) - 704usize];
    ["Offset of field: hvm_hw_cpu::dr3"][::std::mem::offset_of!(hvm_hw_cpu, dr3) - 712usize];
    ["Offset of field: hvm_hw_cpu::dr6"][::std::mem::offset_of!(hvm_hw_cpu, dr6) - 720usize];
    ["Offset of field: hvm_hw_cpu::dr7"][::std::mem::offset_of!(hvm_hw_cpu, dr7) - 728usize];
    ["Offset of field: hvm_hw_cpu::cs_sel"][::std::mem::offset_of!(hvm_hw_cpu, cs_sel) - 736usize];
    ["Offset of field: hvm_hw_cpu::ds_sel"][::std::mem::offset_of!(hvm_hw_cpu, ds_sel) - 740usize];
    ["Offset of field: hvm_hw_cpu::es_sel"][::std::mem::offset_of!(hvm_hw_cpu, es_sel) - 744usize];
    ["Offset of field: hvm_hw_cpu::fs_sel"][::std::mem::offset_of!(hvm_hw_cpu, fs_sel) - 748usize];
    ["Offset of field: hvm_hw_cpu::gs_sel"][::std::mem::offset_of!(hvm_hw_cpu, gs_sel) - 752usize];
    ["Offset of field: hvm_hw_cpu::ss_sel"][::std::mem::offset_of!(hvm_hw_cpu, ss_sel) - 756usize];
    ["Offset of field: hvm_hw_cpu::tr_sel"][::std::mem::offset_of!(hvm_hw_cpu, tr_sel) - 760usize];
    ["Offset of field: hvm_hw_cpu::ldtr_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu, ldtr_sel) - 764usize];
    ["Offset of field: hvm_hw_cpu::cs_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, cs_limit) - 768usize];
    ["Offset of field: hvm_hw_cpu::ds_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, ds_limit) - 772usize];
    ["Offset of field: hvm_hw_cpu::es_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, es_limit) - 776usize];
    ["Offset of field: hvm_hw_cpu::fs_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, fs_limit) - 780usize];
    ["Offset of field: hvm_hw_cpu::gs_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, gs_limit) - 784usize];
    ["Offset of field: hvm_hw_cpu::ss_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, ss_limit) - 788usize];
    ["Offset of field: hvm_hw_cpu::tr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, tr_limit) - 792usize];
    ["Offset of field: hvm_hw_cpu::ldtr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, ldtr_limit) - 796usize];
    ["Offset of field: hvm_hw_cpu::idtr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, idtr_limit) - 800usize];
    ["Offset of field: hvm_hw_cpu::gdtr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu, gdtr_limit) - 804usize];
    ["Offset of field: hvm_hw_cpu::cs_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, cs_base) - 808usize];
    ["Offset of field: hvm_hw_cpu::ds_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, ds_base) - 816usize];
    ["Offset of field: hvm_hw_cpu::es_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, es_base) - 824usize];
    ["Offset of field: hvm_hw_cpu::fs_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, fs_base) - 832usize];
    ["Offset of field: hvm_hw_cpu::gs_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, gs_base) - 840usize];
    ["Offset of field: hvm_hw_cpu::ss_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, ss_base) - 848usize];
    ["Offset of field: hvm_hw_cpu::tr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, tr_base) - 856usize];
    ["Offset of field: hvm_hw_cpu::ldtr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, ldtr_base) - 864usize];
    ["Offset of field: hvm_hw_cpu::idtr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, idtr_base) - 872usize];
    ["Offset of field: hvm_hw_cpu::gdtr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu, gdtr_base) - 880usize];
    ["Offset of field: hvm_hw_cpu::cs_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, cs_arbytes) - 888usize];
    ["Offset of field: hvm_hw_cpu::ds_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, ds_arbytes) - 892usize];
    ["Offset of field: hvm_hw_cpu::es_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, es_arbytes) - 896usize];
    ["Offset of field: hvm_hw_cpu::fs_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, fs_arbytes) - 900usize];
    ["Offset of field: hvm_hw_cpu::gs_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, gs_arbytes) - 904usize];
    ["Offset of field: hvm_hw_cpu::ss_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, ss_arbytes) - 908usize];
    ["Offset of field: hvm_hw_cpu::tr_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, tr_arbytes) - 912usize];
    ["Offset of field: hvm_hw_cpu::ldtr_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu, ldtr_arbytes) - 916usize];
    ["Offset of field: hvm_hw_cpu::sysenter_cs"]
        [::std::mem::offset_of!(hvm_hw_cpu, sysenter_cs) - 920usize];
    ["Offset of field: hvm_hw_cpu::sysenter_esp"]
        [::std::mem::offset_of!(hvm_hw_cpu, sysenter_esp) - 928usize];
    ["Offset of field: hvm_hw_cpu::sysenter_eip"]
        [::std::mem::offset_of!(hvm_hw_cpu, sysenter_eip) - 936usize];
    ["Offset of field: hvm_hw_cpu::shadow_gs"]
        [::std::mem::offset_of!(hvm_hw_cpu, shadow_gs) - 944usize];
    ["Offset of field: hvm_hw_cpu::msr_flags"]
        [::std::mem::offset_of!(hvm_hw_cpu, msr_flags) - 952usize];
    ["Offset of field: hvm_hw_cpu::msr_lstar"]
        [::std::mem::offset_of!(hvm_hw_cpu, msr_lstar) - 960usize];
    ["Offset of field: hvm_hw_cpu::msr_star"]
        [::std::mem::offset_of!(hvm_hw_cpu, msr_star) - 968usize];
    ["Offset of field: hvm_hw_cpu::msr_cstar"]
        [::std::mem::offset_of!(hvm_hw_cpu, msr_cstar) - 976usize];
    ["Offset of field: hvm_hw_cpu::msr_syscall_mask"]
        [::std::mem::offset_of!(hvm_hw_cpu, msr_syscall_mask) - 984usize];
    ["Offset of field: hvm_hw_cpu::msr_efer"]
        [::std::mem::offset_of!(hvm_hw_cpu, msr_efer) - 992usize];
    ["Offset of field: hvm_hw_cpu::msr_tsc_aux"]
        [::std::mem::offset_of!(hvm_hw_cpu, msr_tsc_aux) - 1000usize];
    ["Offset of field: hvm_hw_cpu::tsc"][::std::mem::offset_of!(hvm_hw_cpu, tsc) - 1008usize];
    ["Offset of field: hvm_hw_cpu::error_code"]
        [::std::mem::offset_of!(hvm_hw_cpu, error_code) - 1020usize];
    ["Offset of field: hvm_hw_cpu::flags"][::std::mem::offset_of!(hvm_hw_cpu, flags) - 1024usize];
    ["Offset of field: hvm_hw_cpu::pad0"][::std::mem::offset_of!(hvm_hw_cpu, pad0) - 1028usize];
};
impl Default for hvm_hw_cpu {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hvm_hw_cpu_compat {
    pub fpu_regs: [u8; 512usize],
    pub rax: u64,
    pub rbx: u64,
    pub rcx: u64,
    pub rdx: u64,
    pub rbp: u64,
    pub rsi: u64,
    pub rdi: u64,
    pub rsp: u64,
    pub r8: u64,
    pub r9: u64,
    pub r10: u64,
    pub r11: u64,
    pub r12: u64,
    pub r13: u64,
    pub r14: u64,
    pub r15: u64,
    pub rip: u64,
    pub rflags: u64,
    pub cr0: u64,
    pub cr2: u64,
    pub cr3: u64,
    pub cr4: u64,
    pub dr0: u64,
    pub dr1: u64,
    pub dr2: u64,
    pub dr3: u64,
    pub dr6: u64,
    pub dr7: u64,
    pub cs_sel: u32,
    pub ds_sel: u32,
    pub es_sel: u32,
    pub fs_sel: u32,
    pub gs_sel: u32,
    pub ss_sel: u32,
    pub tr_sel: u32,
    pub ldtr_sel: u32,
    pub cs_limit: u32,
    pub ds_limit: u32,
    pub es_limit: u32,
    pub fs_limit: u32,
    pub gs_limit: u32,
    pub ss_limit: u32,
    pub tr_limit: u32,
    pub ldtr_limit: u32,
    pub idtr_limit: u32,
    pub gdtr_limit: u32,
    pub cs_base: u64,
    pub ds_base: u64,
    pub es_base: u64,
    pub fs_base: u64,
    pub gs_base: u64,
    pub ss_base: u64,
    pub tr_base: u64,
    pub ldtr_base: u64,
    pub idtr_base: u64,
    pub gdtr_base: u64,
    pub cs_arbytes: u32,
    pub ds_arbytes: u32,
    pub es_arbytes: u32,
    pub fs_arbytes: u32,
    pub gs_arbytes: u32,
    pub ss_arbytes: u32,
    pub tr_arbytes: u32,
    pub ldtr_arbytes: u32,
    pub sysenter_cs: u64,
    pub sysenter_esp: u64,
    pub sysenter_eip: u64,
    pub shadow_gs: u64,
    pub msr_flags: u64,
    pub msr_lstar: u64,
    pub msr_star: u64,
    pub msr_cstar: u64,
    pub msr_syscall_mask: u64,
    pub msr_efer: u64,
    pub tsc: u64,
    pub __bindgen_anon_1: hvm_hw_cpu_compat__bindgen_ty_1,
    pub error_code: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hvm_hw_cpu_compat__bindgen_ty_1 {
    pub pending_event: u32,
    pub __bindgen_anon_1: hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1>() - 4usize];
};
impl hvm_hw_cpu_compat__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn pending_vector(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_pending_vector(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_type(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_pending_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_error_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_error_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 19u8) as u32) }
    }
    #[inline]
    pub fn set_pending_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 19u8, val as u64)
        }
    }
    #[inline]
    pub fn pending_valid(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pending_valid(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pending_vector: u8,
        pending_type: u8,
        pending_error_valid: u8,
        pending_reserved: u32,
        pending_valid: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let pending_vector: u8 = unsafe { ::std::mem::transmute(pending_vector) };
            pending_vector as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let pending_type: u8 = unsafe { ::std::mem::transmute(pending_type) };
            pending_type as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let pending_error_valid: u8 = unsafe { ::std::mem::transmute(pending_error_valid) };
            pending_error_valid as u64
        });
        __bindgen_bitfield_unit.set(12usize, 19u8, {
            let pending_reserved: u32 = unsafe { ::std::mem::transmute(pending_reserved) };
            pending_reserved as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let pending_valid: u8 = unsafe { ::std::mem::transmute(pending_valid) };
            pending_valid as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_cpu_compat__bindgen_ty_1"]
        [::std::mem::size_of::<hvm_hw_cpu_compat__bindgen_ty_1>() - 4usize];
    ["Alignment of hvm_hw_cpu_compat__bindgen_ty_1"]
        [::std::mem::align_of::<hvm_hw_cpu_compat__bindgen_ty_1>() - 4usize];
    ["Offset of field: hvm_hw_cpu_compat__bindgen_ty_1::pending_event"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat__bindgen_ty_1, pending_event) - 0usize];
};
impl Default for hvm_hw_cpu_compat__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_cpu_compat"][::std::mem::size_of::<hvm_hw_cpu_compat>() - 1016usize];
    ["Alignment of hvm_hw_cpu_compat"][::std::mem::align_of::<hvm_hw_cpu_compat>() - 8usize];
    ["Offset of field: hvm_hw_cpu_compat::fpu_regs"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, fpu_regs) - 0usize];
    ["Offset of field: hvm_hw_cpu_compat::rax"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rax) - 512usize];
    ["Offset of field: hvm_hw_cpu_compat::rbx"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rbx) - 520usize];
    ["Offset of field: hvm_hw_cpu_compat::rcx"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rcx) - 528usize];
    ["Offset of field: hvm_hw_cpu_compat::rdx"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rdx) - 536usize];
    ["Offset of field: hvm_hw_cpu_compat::rbp"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rbp) - 544usize];
    ["Offset of field: hvm_hw_cpu_compat::rsi"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rsi) - 552usize];
    ["Offset of field: hvm_hw_cpu_compat::rdi"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rdi) - 560usize];
    ["Offset of field: hvm_hw_cpu_compat::rsp"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rsp) - 568usize];
    ["Offset of field: hvm_hw_cpu_compat::r8"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r8) - 576usize];
    ["Offset of field: hvm_hw_cpu_compat::r9"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r9) - 584usize];
    ["Offset of field: hvm_hw_cpu_compat::r10"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r10) - 592usize];
    ["Offset of field: hvm_hw_cpu_compat::r11"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r11) - 600usize];
    ["Offset of field: hvm_hw_cpu_compat::r12"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r12) - 608usize];
    ["Offset of field: hvm_hw_cpu_compat::r13"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r13) - 616usize];
    ["Offset of field: hvm_hw_cpu_compat::r14"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r14) - 624usize];
    ["Offset of field: hvm_hw_cpu_compat::r15"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, r15) - 632usize];
    ["Offset of field: hvm_hw_cpu_compat::rip"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rip) - 640usize];
    ["Offset of field: hvm_hw_cpu_compat::rflags"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, rflags) - 648usize];
    ["Offset of field: hvm_hw_cpu_compat::cr0"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cr0) - 656usize];
    ["Offset of field: hvm_hw_cpu_compat::cr2"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cr2) - 664usize];
    ["Offset of field: hvm_hw_cpu_compat::cr3"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cr3) - 672usize];
    ["Offset of field: hvm_hw_cpu_compat::cr4"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cr4) - 680usize];
    ["Offset of field: hvm_hw_cpu_compat::dr0"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, dr0) - 688usize];
    ["Offset of field: hvm_hw_cpu_compat::dr1"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, dr1) - 696usize];
    ["Offset of field: hvm_hw_cpu_compat::dr2"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, dr2) - 704usize];
    ["Offset of field: hvm_hw_cpu_compat::dr3"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, dr3) - 712usize];
    ["Offset of field: hvm_hw_cpu_compat::dr6"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, dr6) - 720usize];
    ["Offset of field: hvm_hw_cpu_compat::dr7"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, dr7) - 728usize];
    ["Offset of field: hvm_hw_cpu_compat::cs_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cs_sel) - 736usize];
    ["Offset of field: hvm_hw_cpu_compat::ds_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ds_sel) - 740usize];
    ["Offset of field: hvm_hw_cpu_compat::es_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, es_sel) - 744usize];
    ["Offset of field: hvm_hw_cpu_compat::fs_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, fs_sel) - 748usize];
    ["Offset of field: hvm_hw_cpu_compat::gs_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, gs_sel) - 752usize];
    ["Offset of field: hvm_hw_cpu_compat::ss_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ss_sel) - 756usize];
    ["Offset of field: hvm_hw_cpu_compat::tr_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, tr_sel) - 760usize];
    ["Offset of field: hvm_hw_cpu_compat::ldtr_sel"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ldtr_sel) - 764usize];
    ["Offset of field: hvm_hw_cpu_compat::cs_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cs_limit) - 768usize];
    ["Offset of field: hvm_hw_cpu_compat::ds_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ds_limit) - 772usize];
    ["Offset of field: hvm_hw_cpu_compat::es_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, es_limit) - 776usize];
    ["Offset of field: hvm_hw_cpu_compat::fs_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, fs_limit) - 780usize];
    ["Offset of field: hvm_hw_cpu_compat::gs_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, gs_limit) - 784usize];
    ["Offset of field: hvm_hw_cpu_compat::ss_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ss_limit) - 788usize];
    ["Offset of field: hvm_hw_cpu_compat::tr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, tr_limit) - 792usize];
    ["Offset of field: hvm_hw_cpu_compat::ldtr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ldtr_limit) - 796usize];
    ["Offset of field: hvm_hw_cpu_compat::idtr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, idtr_limit) - 800usize];
    ["Offset of field: hvm_hw_cpu_compat::gdtr_limit"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, gdtr_limit) - 804usize];
    ["Offset of field: hvm_hw_cpu_compat::cs_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cs_base) - 808usize];
    ["Offset of field: hvm_hw_cpu_compat::ds_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ds_base) - 816usize];
    ["Offset of field: hvm_hw_cpu_compat::es_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, es_base) - 824usize];
    ["Offset of field: hvm_hw_cpu_compat::fs_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, fs_base) - 832usize];
    ["Offset of field: hvm_hw_cpu_compat::gs_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, gs_base) - 840usize];
    ["Offset of field: hvm_hw_cpu_compat::ss_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ss_base) - 848usize];
    ["Offset of field: hvm_hw_cpu_compat::tr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, tr_base) - 856usize];
    ["Offset of field: hvm_hw_cpu_compat::ldtr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ldtr_base) - 864usize];
    ["Offset of field: hvm_hw_cpu_compat::idtr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, idtr_base) - 872usize];
    ["Offset of field: hvm_hw_cpu_compat::gdtr_base"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, gdtr_base) - 880usize];
    ["Offset of field: hvm_hw_cpu_compat::cs_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, cs_arbytes) - 888usize];
    ["Offset of field: hvm_hw_cpu_compat::ds_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ds_arbytes) - 892usize];
    ["Offset of field: hvm_hw_cpu_compat::es_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, es_arbytes) - 896usize];
    ["Offset of field: hvm_hw_cpu_compat::fs_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, fs_arbytes) - 900usize];
    ["Offset of field: hvm_hw_cpu_compat::gs_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, gs_arbytes) - 904usize];
    ["Offset of field: hvm_hw_cpu_compat::ss_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ss_arbytes) - 908usize];
    ["Offset of field: hvm_hw_cpu_compat::tr_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, tr_arbytes) - 912usize];
    ["Offset of field: hvm_hw_cpu_compat::ldtr_arbytes"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, ldtr_arbytes) - 916usize];
    ["Offset of field: hvm_hw_cpu_compat::sysenter_cs"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, sysenter_cs) - 920usize];
    ["Offset of field: hvm_hw_cpu_compat::sysenter_esp"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, sysenter_esp) - 928usize];
    ["Offset of field: hvm_hw_cpu_compat::sysenter_eip"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, sysenter_eip) - 936usize];
    ["Offset of field: hvm_hw_cpu_compat::shadow_gs"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, shadow_gs) - 944usize];
    ["Offset of field: hvm_hw_cpu_compat::msr_flags"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, msr_flags) - 952usize];
    ["Offset of field: hvm_hw_cpu_compat::msr_lstar"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, msr_lstar) - 960usize];
    ["Offset of field: hvm_hw_cpu_compat::msr_star"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, msr_star) - 968usize];
    ["Offset of field: hvm_hw_cpu_compat::msr_cstar"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, msr_cstar) - 976usize];
    ["Offset of field: hvm_hw_cpu_compat::msr_syscall_mask"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, msr_syscall_mask) - 984usize];
    ["Offset of field: hvm_hw_cpu_compat::msr_efer"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, msr_efer) - 992usize];
    ["Offset of field: hvm_hw_cpu_compat::tsc"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, tsc) - 1000usize];
    ["Offset of field: hvm_hw_cpu_compat::error_code"]
        [::std::mem::offset_of!(hvm_hw_cpu_compat, error_code) - 1012usize];
};
impl Default for hvm_hw_cpu_compat {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __HVM_SAVE_TYPE_CPU {
    pub t: hvm_hw_cpu,
    pub c: [::std::os::raw::c_char; 2usize],
    pub cpt: [::std::os::raw::c_char; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_CPU"][::std::mem::size_of::<__HVM_SAVE_TYPE_CPU>() - 1040usize];
    ["Alignment of __HVM_SAVE_TYPE_CPU"][::std::mem::align_of::<__HVM_SAVE_TYPE_CPU>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_CPU::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_CPU, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_CPU::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_CPU, c) - 1032usize];
    ["Offset of field: __HVM_SAVE_TYPE_CPU::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_CPU, cpt) - 1034usize];
};
impl Default for __HVM_SAVE_TYPE_CPU {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_vpic {
    pub irr: u8,
    pub imr: u8,
    pub isr: u8,
    pub irq_base: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub elcr: u8,
    pub int_output: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_vpic"][::std::mem::size_of::<hvm_hw_vpic>() - 8usize];
    ["Alignment of hvm_hw_vpic"][::std::mem::align_of::<hvm_hw_vpic>() - 1usize];
    ["Offset of field: hvm_hw_vpic::irr"][::std::mem::offset_of!(hvm_hw_vpic, irr) - 0usize];
    ["Offset of field: hvm_hw_vpic::imr"][::std::mem::offset_of!(hvm_hw_vpic, imr) - 1usize];
    ["Offset of field: hvm_hw_vpic::isr"][::std::mem::offset_of!(hvm_hw_vpic, isr) - 2usize];
    ["Offset of field: hvm_hw_vpic::irq_base"]
        [::std::mem::offset_of!(hvm_hw_vpic, irq_base) - 3usize];
    ["Offset of field: hvm_hw_vpic::elcr"][::std::mem::offset_of!(hvm_hw_vpic, elcr) - 6usize];
    ["Offset of field: hvm_hw_vpic::int_output"]
        [::std::mem::offset_of!(hvm_hw_vpic, int_output) - 7usize];
};
impl hvm_hw_vpic {
    #[inline]
    pub fn init_state(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_init_state(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn priority_add(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_priority_add(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn readsel_isr(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_readsel_isr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn poll(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_poll(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn auto_eoi(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_auto_eoi(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rotate_on_auto_eoi(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rotate_on_auto_eoi(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn special_fully_nested_mode(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_special_fully_nested_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn special_mask_mode(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_special_mask_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_master(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_master(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        init_state: u8,
        priority_add: u8,
        readsel_isr: u8,
        poll: u8,
        auto_eoi: u8,
        rotate_on_auto_eoi: u8,
        special_fully_nested_mode: u8,
        special_mask_mode: u8,
        is_master: u8,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let init_state: u8 = unsafe { ::std::mem::transmute(init_state) };
            init_state as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let priority_add: u8 = unsafe { ::std::mem::transmute(priority_add) };
            priority_add as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let readsel_isr: u8 = unsafe { ::std::mem::transmute(readsel_isr) };
            readsel_isr as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let poll: u8 = unsafe { ::std::mem::transmute(poll) };
            poll as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let auto_eoi: u8 = unsafe { ::std::mem::transmute(auto_eoi) };
            auto_eoi as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let rotate_on_auto_eoi: u8 = unsafe { ::std::mem::transmute(rotate_on_auto_eoi) };
            rotate_on_auto_eoi as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let special_fully_nested_mode: u8 =
                unsafe { ::std::mem::transmute(special_fully_nested_mode) };
            special_fully_nested_mode as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let special_mask_mode: u8 = unsafe { ::std::mem::transmute(special_mask_mode) };
            special_mask_mode as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let is_master: u8 = unsafe { ::std::mem::transmute(is_master) };
            is_master as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_PIC {
    pub t: hvm_hw_vpic,
    pub c: [::std::os::raw::c_char; 3usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_PIC"][::std::mem::size_of::<__HVM_SAVE_TYPE_PIC>() - 12usize];
    ["Alignment of __HVM_SAVE_TYPE_PIC"][::std::mem::align_of::<__HVM_SAVE_TYPE_PIC>() - 1usize];
    ["Offset of field: __HVM_SAVE_TYPE_PIC::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PIC, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_PIC::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PIC, c) - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_PIC::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PIC, cpt) - 11usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union vioapic_redir_entry {
    pub bits: u64,
    pub fields: vioapic_redir_entry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct vioapic_redir_entry__bindgen_ty_1 {
    pub vector: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub reserved: [u8; 4usize],
    pub dest_id: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vioapic_redir_entry__bindgen_ty_1"]
        [::std::mem::size_of::<vioapic_redir_entry__bindgen_ty_1>() - 8usize];
    ["Alignment of vioapic_redir_entry__bindgen_ty_1"]
        [::std::mem::align_of::<vioapic_redir_entry__bindgen_ty_1>() - 1usize];
    ["Offset of field: vioapic_redir_entry__bindgen_ty_1::vector"]
        [::std::mem::offset_of!(vioapic_redir_entry__bindgen_ty_1, vector) - 0usize];
    ["Offset of field: vioapic_redir_entry__bindgen_ty_1::reserved"]
        [::std::mem::offset_of!(vioapic_redir_entry__bindgen_ty_1, reserved) - 3usize];
    ["Offset of field: vioapic_redir_entry__bindgen_ty_1::dest_id"]
        [::std::mem::offset_of!(vioapic_redir_entry__bindgen_ty_1, dest_id) - 7usize];
};
impl vioapic_redir_entry__bindgen_ty_1 {
    #[inline]
    pub fn delivery_mode(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_delivery_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn dest_mode(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_dest_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn delivery_status(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_delivery_status(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn polarity(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_polarity(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn remote_irr(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_remote_irr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn trig_mode(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_trig_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mask(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mask(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserve(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_reserve(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        delivery_mode: u8,
        dest_mode: u8,
        delivery_status: u8,
        polarity: u8,
        remote_irr: u8,
        trig_mode: u8,
        mask: u8,
        reserve: u8,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let delivery_mode: u8 = unsafe { ::std::mem::transmute(delivery_mode) };
            delivery_mode as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let dest_mode: u8 = unsafe { ::std::mem::transmute(dest_mode) };
            dest_mode as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let delivery_status: u8 = unsafe { ::std::mem::transmute(delivery_status) };
            delivery_status as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let polarity: u8 = unsafe { ::std::mem::transmute(polarity) };
            polarity as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let remote_irr: u8 = unsafe { ::std::mem::transmute(remote_irr) };
            remote_irr as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let trig_mode: u8 = unsafe { ::std::mem::transmute(trig_mode) };
            trig_mode as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let mask: u8 = unsafe { ::std::mem::transmute(mask) };
            mask as u64
        });
        __bindgen_bitfield_unit.set(9usize, 7u8, {
            let reserve: u8 = unsafe { ::std::mem::transmute(reserve) };
            reserve as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vioapic_redir_entry"][::std::mem::size_of::<vioapic_redir_entry>() - 8usize];
    ["Alignment of vioapic_redir_entry"][::std::mem::align_of::<vioapic_redir_entry>() - 8usize];
    ["Offset of field: vioapic_redir_entry::bits"]
        [::std::mem::offset_of!(vioapic_redir_entry, bits) - 0usize];
    ["Offset of field: vioapic_redir_entry::fields"]
        [::std::mem::offset_of!(vioapic_redir_entry, fields) - 0usize];
};
impl Default for vioapic_redir_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hvm_hw_vioapic {
    pub base_address: u64,
    pub ioregsel: u32,
    pub id: u32,
    pub redirtbl: [vioapic_redir_entry; 48usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_vioapic"][::std::mem::size_of::<hvm_hw_vioapic>() - 400usize];
    ["Alignment of hvm_hw_vioapic"][::std::mem::align_of::<hvm_hw_vioapic>() - 8usize];
    ["Offset of field: hvm_hw_vioapic::base_address"]
        [::std::mem::offset_of!(hvm_hw_vioapic, base_address) - 0usize];
    ["Offset of field: hvm_hw_vioapic::ioregsel"]
        [::std::mem::offset_of!(hvm_hw_vioapic, ioregsel) - 8usize];
    ["Offset of field: hvm_hw_vioapic::id"][::std::mem::offset_of!(hvm_hw_vioapic, id) - 12usize];
    ["Offset of field: hvm_hw_vioapic::redirtbl"]
        [::std::mem::offset_of!(hvm_hw_vioapic, redirtbl) - 16usize];
};
impl Default for hvm_hw_vioapic {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __HVM_SAVE_TYPE_IOAPIC {
    pub t: hvm_hw_vioapic,
    pub c: [::std::os::raw::c_char; 4usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_IOAPIC"][::std::mem::size_of::<__HVM_SAVE_TYPE_IOAPIC>() - 408usize];
    ["Alignment of __HVM_SAVE_TYPE_IOAPIC"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_IOAPIC>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_IOAPIC::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_IOAPIC, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_IOAPIC::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_IOAPIC, c) - 400usize];
    ["Offset of field: __HVM_SAVE_TYPE_IOAPIC::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_IOAPIC, cpt) - 404usize];
};
impl Default for __HVM_SAVE_TYPE_IOAPIC {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_lapic {
    pub apic_base_msr: u64,
    pub disabled: u32,
    pub timer_divisor: u32,
    pub tdt_msr: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_lapic"][::std::mem::size_of::<hvm_hw_lapic>() - 24usize];
    ["Alignment of hvm_hw_lapic"][::std::mem::align_of::<hvm_hw_lapic>() - 8usize];
    ["Offset of field: hvm_hw_lapic::apic_base_msr"]
        [::std::mem::offset_of!(hvm_hw_lapic, apic_base_msr) - 0usize];
    ["Offset of field: hvm_hw_lapic::disabled"]
        [::std::mem::offset_of!(hvm_hw_lapic, disabled) - 8usize];
    ["Offset of field: hvm_hw_lapic::timer_divisor"]
        [::std::mem::offset_of!(hvm_hw_lapic, timer_divisor) - 12usize];
    ["Offset of field: hvm_hw_lapic::tdt_msr"]
        [::std::mem::offset_of!(hvm_hw_lapic, tdt_msr) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_LAPIC {
    pub t: hvm_hw_lapic,
    pub c: [::std::os::raw::c_char; 5usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_LAPIC"][::std::mem::size_of::<__HVM_SAVE_TYPE_LAPIC>() - 32usize];
    ["Alignment of __HVM_SAVE_TYPE_LAPIC"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_LAPIC>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_LAPIC::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_LAPIC, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_LAPIC::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_LAPIC, c) - 24usize];
    ["Offset of field: __HVM_SAVE_TYPE_LAPIC::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_LAPIC, cpt) - 29usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hvm_hw_lapic_regs {
    pub data: [u8; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_lapic_regs"][::std::mem::size_of::<hvm_hw_lapic_regs>() - 1024usize];
    ["Alignment of hvm_hw_lapic_regs"][::std::mem::align_of::<hvm_hw_lapic_regs>() - 1usize];
    ["Offset of field: hvm_hw_lapic_regs::data"]
        [::std::mem::offset_of!(hvm_hw_lapic_regs, data) - 0usize];
};
impl Default for hvm_hw_lapic_regs {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_LAPIC_REGS {
    pub t: hvm_hw_lapic_regs,
    pub c: [::std::os::raw::c_char; 6usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_LAPIC_REGS"]
        [::std::mem::size_of::<__HVM_SAVE_TYPE_LAPIC_REGS>() - 1031usize];
    ["Alignment of __HVM_SAVE_TYPE_LAPIC_REGS"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_LAPIC_REGS>() - 1usize];
    ["Offset of field: __HVM_SAVE_TYPE_LAPIC_REGS::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_LAPIC_REGS, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_LAPIC_REGS::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_LAPIC_REGS, c) - 1024usize];
    ["Offset of field: __HVM_SAVE_TYPE_LAPIC_REGS::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_LAPIC_REGS, cpt) - 1030usize];
};
impl Default for __HVM_SAVE_TYPE_LAPIC_REGS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hvm_hw_pci_irqs {
    pub __bindgen_anon_1: hvm_hw_pci_irqs__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hvm_hw_pci_irqs__bindgen_ty_1 {
    pub i: [::std::os::raw::c_ulong; 2usize],
    pub pad: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_pci_irqs__bindgen_ty_1"]
        [::std::mem::size_of::<hvm_hw_pci_irqs__bindgen_ty_1>() - 16usize];
    ["Alignment of hvm_hw_pci_irqs__bindgen_ty_1"]
        [::std::mem::align_of::<hvm_hw_pci_irqs__bindgen_ty_1>() - 8usize];
    ["Offset of field: hvm_hw_pci_irqs__bindgen_ty_1::i"]
        [::std::mem::offset_of!(hvm_hw_pci_irqs__bindgen_ty_1, i) - 0usize];
    ["Offset of field: hvm_hw_pci_irqs__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(hvm_hw_pci_irqs__bindgen_ty_1, pad) - 0usize];
};
impl Default for hvm_hw_pci_irqs__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_pci_irqs"][::std::mem::size_of::<hvm_hw_pci_irqs>() - 16usize];
    ["Alignment of hvm_hw_pci_irqs"][::std::mem::align_of::<hvm_hw_pci_irqs>() - 8usize];
};
impl Default for hvm_hw_pci_irqs {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __HVM_SAVE_TYPE_PCI_IRQ {
    pub t: hvm_hw_pci_irqs,
    pub c: [::std::os::raw::c_char; 7usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_PCI_IRQ"][::std::mem::size_of::<__HVM_SAVE_TYPE_PCI_IRQ>() - 24usize];
    ["Alignment of __HVM_SAVE_TYPE_PCI_IRQ"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_PCI_IRQ>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_PCI_IRQ::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PCI_IRQ, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_PCI_IRQ::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PCI_IRQ, c) - 16usize];
    ["Offset of field: __HVM_SAVE_TYPE_PCI_IRQ::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PCI_IRQ, cpt) - 23usize];
};
impl Default for __HVM_SAVE_TYPE_PCI_IRQ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hvm_hw_isa_irqs {
    pub __bindgen_anon_1: hvm_hw_isa_irqs__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hvm_hw_isa_irqs__bindgen_ty_1 {
    pub i: [::std::os::raw::c_ulong; 1usize],
    pub pad: [u64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_isa_irqs__bindgen_ty_1"]
        [::std::mem::size_of::<hvm_hw_isa_irqs__bindgen_ty_1>() - 8usize];
    ["Alignment of hvm_hw_isa_irqs__bindgen_ty_1"]
        [::std::mem::align_of::<hvm_hw_isa_irqs__bindgen_ty_1>() - 8usize];
    ["Offset of field: hvm_hw_isa_irqs__bindgen_ty_1::i"]
        [::std::mem::offset_of!(hvm_hw_isa_irqs__bindgen_ty_1, i) - 0usize];
    ["Offset of field: hvm_hw_isa_irqs__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(hvm_hw_isa_irqs__bindgen_ty_1, pad) - 0usize];
};
impl Default for hvm_hw_isa_irqs__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_isa_irqs"][::std::mem::size_of::<hvm_hw_isa_irqs>() - 8usize];
    ["Alignment of hvm_hw_isa_irqs"][::std::mem::align_of::<hvm_hw_isa_irqs>() - 8usize];
};
impl Default for hvm_hw_isa_irqs {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __HVM_SAVE_TYPE_ISA_IRQ {
    pub t: hvm_hw_isa_irqs,
    pub c: [::std::os::raw::c_char; 8usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_ISA_IRQ"][::std::mem::size_of::<__HVM_SAVE_TYPE_ISA_IRQ>() - 24usize];
    ["Alignment of __HVM_SAVE_TYPE_ISA_IRQ"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_ISA_IRQ>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_ISA_IRQ::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_ISA_IRQ, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_ISA_IRQ::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_ISA_IRQ, c) - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_ISA_IRQ::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_ISA_IRQ, cpt) - 16usize];
};
impl Default for __HVM_SAVE_TYPE_ISA_IRQ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_pci_link {
    pub route: [u8; 4usize],
    pub pad0: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_pci_link"][::std::mem::size_of::<hvm_hw_pci_link>() - 8usize];
    ["Alignment of hvm_hw_pci_link"][::std::mem::align_of::<hvm_hw_pci_link>() - 1usize];
    ["Offset of field: hvm_hw_pci_link::route"]
        [::std::mem::offset_of!(hvm_hw_pci_link, route) - 0usize];
    ["Offset of field: hvm_hw_pci_link::pad0"]
        [::std::mem::offset_of!(hvm_hw_pci_link, pad0) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_PCI_LINK {
    pub t: hvm_hw_pci_link,
    pub c: [::std::os::raw::c_char; 9usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_PCI_LINK"]
        [::std::mem::size_of::<__HVM_SAVE_TYPE_PCI_LINK>() - 18usize];
    ["Alignment of __HVM_SAVE_TYPE_PCI_LINK"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_PCI_LINK>() - 1usize];
    ["Offset of field: __HVM_SAVE_TYPE_PCI_LINK::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PCI_LINK, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_PCI_LINK::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PCI_LINK, c) - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_PCI_LINK::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PCI_LINK, cpt) - 17usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_pit {
    pub channels: [hvm_hw_pit_hvm_hw_pit_channel; 3usize],
    pub speaker_data_on: u32,
    pub pad0: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_pit_hvm_hw_pit_channel {
    pub count: u32,
    pub latched_count: u16,
    pub count_latched: u8,
    pub status_latched: u8,
    pub status: u8,
    pub read_state: u8,
    pub write_state: u8,
    pub write_latch: u8,
    pub rw_mode: u8,
    pub mode: u8,
    pub bcd: u8,
    pub gate: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_pit_hvm_hw_pit_channel"]
        [::std::mem::size_of::<hvm_hw_pit_hvm_hw_pit_channel>() - 16usize];
    ["Alignment of hvm_hw_pit_hvm_hw_pit_channel"]
        [::std::mem::align_of::<hvm_hw_pit_hvm_hw_pit_channel>() - 4usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::count"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, count) - 0usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::latched_count"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, latched_count) - 4usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::count_latched"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, count_latched) - 6usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::status_latched"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, status_latched) - 7usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::status"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, status) - 8usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::read_state"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, read_state) - 9usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::write_state"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, write_state) - 10usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::write_latch"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, write_latch) - 11usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::rw_mode"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, rw_mode) - 12usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::mode"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, mode) - 13usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::bcd"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, bcd) - 14usize];
    ["Offset of field: hvm_hw_pit_hvm_hw_pit_channel::gate"]
        [::std::mem::offset_of!(hvm_hw_pit_hvm_hw_pit_channel, gate) - 15usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_pit"][::std::mem::size_of::<hvm_hw_pit>() - 56usize];
    ["Alignment of hvm_hw_pit"][::std::mem::align_of::<hvm_hw_pit>() - 4usize];
    ["Offset of field: hvm_hw_pit::channels"]
        [::std::mem::offset_of!(hvm_hw_pit, channels) - 0usize];
    ["Offset of field: hvm_hw_pit::speaker_data_on"]
        [::std::mem::offset_of!(hvm_hw_pit, speaker_data_on) - 48usize];
    ["Offset of field: hvm_hw_pit::pad0"][::std::mem::offset_of!(hvm_hw_pit, pad0) - 52usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_PIT {
    pub t: hvm_hw_pit,
    pub c: [::std::os::raw::c_char; 10usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_PIT"][::std::mem::size_of::<__HVM_SAVE_TYPE_PIT>() - 68usize];
    ["Alignment of __HVM_SAVE_TYPE_PIT"][::std::mem::align_of::<__HVM_SAVE_TYPE_PIT>() - 4usize];
    ["Offset of field: __HVM_SAVE_TYPE_PIT::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PIT, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_PIT::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PIT, c) - 56usize];
    ["Offset of field: __HVM_SAVE_TYPE_PIT::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PIT, cpt) - 66usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_rtc {
    pub cmos_data: [u8; 14usize],
    pub cmos_index: u8,
    pub pad0: u8,
    pub rtc_offset: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_rtc"][::std::mem::size_of::<hvm_hw_rtc>() - 24usize];
    ["Alignment of hvm_hw_rtc"][::std::mem::align_of::<hvm_hw_rtc>() - 8usize];
    ["Offset of field: hvm_hw_rtc::cmos_data"]
        [::std::mem::offset_of!(hvm_hw_rtc, cmos_data) - 0usize];
    ["Offset of field: hvm_hw_rtc::cmos_index"]
        [::std::mem::offset_of!(hvm_hw_rtc, cmos_index) - 14usize];
    ["Offset of field: hvm_hw_rtc::pad0"][::std::mem::offset_of!(hvm_hw_rtc, pad0) - 15usize];
    ["Offset of field: hvm_hw_rtc::rtc_offset"]
        [::std::mem::offset_of!(hvm_hw_rtc, rtc_offset) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_RTC {
    pub t: hvm_hw_rtc,
    pub c: [::std::os::raw::c_char; 11usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_RTC"][::std::mem::size_of::<__HVM_SAVE_TYPE_RTC>() - 40usize];
    ["Alignment of __HVM_SAVE_TYPE_RTC"][::std::mem::align_of::<__HVM_SAVE_TYPE_RTC>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_RTC::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_RTC, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_RTC::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_RTC, c) - 24usize];
    ["Offset of field: __HVM_SAVE_TYPE_RTC::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_RTC, cpt) - 35usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hvm_hw_hpet {
    pub capability: u64,
    pub res0: u64,
    pub config: u64,
    pub res1: u64,
    pub isr: u64,
    pub res2: [u64; 25usize],
    pub mc64: u64,
    pub res3: u64,
    pub timers: [hvm_hw_hpet__bindgen_ty_1; 3usize],
    pub res5: [u64; 84usize],
    pub period: [u64; 3usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_hpet__bindgen_ty_1 {
    pub config: u64,
    pub cmp: u64,
    pub fsb: u64,
    pub res4: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_hpet__bindgen_ty_1"]
        [::std::mem::size_of::<hvm_hw_hpet__bindgen_ty_1>() - 32usize];
    ["Alignment of hvm_hw_hpet__bindgen_ty_1"]
        [::std::mem::align_of::<hvm_hw_hpet__bindgen_ty_1>() - 8usize];
    ["Offset of field: hvm_hw_hpet__bindgen_ty_1::config"]
        [::std::mem::offset_of!(hvm_hw_hpet__bindgen_ty_1, config) - 0usize];
    ["Offset of field: hvm_hw_hpet__bindgen_ty_1::cmp"]
        [::std::mem::offset_of!(hvm_hw_hpet__bindgen_ty_1, cmp) - 8usize];
    ["Offset of field: hvm_hw_hpet__bindgen_ty_1::fsb"]
        [::std::mem::offset_of!(hvm_hw_hpet__bindgen_ty_1, fsb) - 16usize];
    ["Offset of field: hvm_hw_hpet__bindgen_ty_1::res4"]
        [::std::mem::offset_of!(hvm_hw_hpet__bindgen_ty_1, res4) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_hpet"][::std::mem::size_of::<hvm_hw_hpet>() - 1048usize];
    ["Alignment of hvm_hw_hpet"][::std::mem::align_of::<hvm_hw_hpet>() - 8usize];
    ["Offset of field: hvm_hw_hpet::capability"]
        [::std::mem::offset_of!(hvm_hw_hpet, capability) - 0usize];
    ["Offset of field: hvm_hw_hpet::res0"][::std::mem::offset_of!(hvm_hw_hpet, res0) - 8usize];
    ["Offset of field: hvm_hw_hpet::config"][::std::mem::offset_of!(hvm_hw_hpet, config) - 16usize];
    ["Offset of field: hvm_hw_hpet::res1"][::std::mem::offset_of!(hvm_hw_hpet, res1) - 24usize];
    ["Offset of field: hvm_hw_hpet::isr"][::std::mem::offset_of!(hvm_hw_hpet, isr) - 32usize];
    ["Offset of field: hvm_hw_hpet::res2"][::std::mem::offset_of!(hvm_hw_hpet, res2) - 40usize];
    ["Offset of field: hvm_hw_hpet::mc64"][::std::mem::offset_of!(hvm_hw_hpet, mc64) - 240usize];
    ["Offset of field: hvm_hw_hpet::res3"][::std::mem::offset_of!(hvm_hw_hpet, res3) - 248usize];
    ["Offset of field: hvm_hw_hpet::timers"]
        [::std::mem::offset_of!(hvm_hw_hpet, timers) - 256usize];
    ["Offset of field: hvm_hw_hpet::res5"][::std::mem::offset_of!(hvm_hw_hpet, res5) - 352usize];
    ["Offset of field: hvm_hw_hpet::period"]
        [::std::mem::offset_of!(hvm_hw_hpet, period) - 1024usize];
};
impl Default for hvm_hw_hpet {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_HPET {
    pub t: hvm_hw_hpet,
    pub c: [::std::os::raw::c_char; 12usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_HPET"][::std::mem::size_of::<__HVM_SAVE_TYPE_HPET>() - 1064usize];
    ["Alignment of __HVM_SAVE_TYPE_HPET"][::std::mem::align_of::<__HVM_SAVE_TYPE_HPET>() - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_HPET::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_HPET, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_HPET::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_HPET, c) - 1048usize];
    ["Offset of field: __HVM_SAVE_TYPE_HPET::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_HPET, cpt) - 1060usize];
};
impl Default for __HVM_SAVE_TYPE_HPET {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_pmtimer {
    pub tmr_val: u32,
    pub pm1a_sts: u16,
    pub pm1a_en: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hvm_hw_pmtimer"][::std::mem::size_of::<hvm_hw_pmtimer>() - 8usize];
    ["Alignment of hvm_hw_pmtimer"][::std::mem::align_of::<hvm_hw_pmtimer>() - 4usize];
    ["Offset of field: hvm_hw_pmtimer::tmr_val"]
        [::std::mem::offset_of!(hvm_hw_pmtimer, tmr_val) - 0usize];
    ["Offset of field: hvm_hw_pmtimer::pm1a_sts"]
        [::std::mem::offset_of!(hvm_hw_pmtimer, pm1a_sts) - 4usize];
    ["Offset of field: hvm_hw_pmtimer::pm1a_en"]
        [::std::mem::offset_of!(hvm_hw_pmtimer, pm1a_en) - 6usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __HVM_SAVE_TYPE_PMTIMER {
    pub t: hvm_hw_pmtimer,
    pub c: [::std::os::raw::c_char; 13usize],
    pub cpt: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __HVM_SAVE_TYPE_PMTIMER"][::std::mem::size_of::<__HVM_SAVE_TYPE_PMTIMER>() - 24usize];
    ["Alignment of __HVM_SAVE_TYPE_PMTIMER"]
        [::std::mem::align_of::<__HVM_SAVE_TYPE_PMTIMER>() - 4usize];
    ["Offset of field: __HVM_SAVE_TYPE_PMTIMER::t"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PMTIMER, t) - 0usize];
    ["Offset of field: __HVM_SAVE_TYPE_PMTIMER::c"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PMTIMER, c) - 8usize];
    ["Offset of field: __HVM_SAVE_TYPE_PMTIMER::cpt"]
        [::std::mem::offset_of!(__HVM_SAVE_TYPE_PMTIMER, cpt) - 21usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct hvm_hw_mtrr {
    pub msr_pat_cr: u64,
    pub msr_mtrr_var: [u64; 16usize],
    pub msr_mtrr_fixed: [u64; 11usize],
    pub msr_mtrr_cap: u64,
    pub msr_mtrr_def_type: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
